const Promise = require('../utils/promise.min.js');
const lodash = require('../utils/lodash.min.js');
const GLOBAL = require('../global.js');
const request = require('../utils/request.js').request;

var LocationSvc = function() {

    this.provinces = [
        {
            province: '上海市',
            cities: [
                '黄浦区',
                '浦东新区',
                '徐汇区',
                '长宁区',
                '静安区',
                '普陀区',
                '虹口区',
                '杨浦区',
                '闵行区',
                '宝山区',
                '嘉定区',
                '金山区',
                '松江区',
                '青浦区',
                '奉贤区',
                '崇明区'
            ]
        }
    ];

    this.locations = [
        {
            district: '黄浦区',
            streets: [
                {
                    name: '南京东路街道',
                    service: {
                        name: '南京东路街道社区事务受理中心',
                        tel: '021-63271866',
                        address: '江阴路101号',
                        time: '周一至周日 8:30-16:30'
                    },
                    police: {
                        name: '南京东路派出所',
                        tel: '021-63280123',
                        address: '汉口路广西路交叉口',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '南京东路街道社区医院',
                        tel: '021-63272837',
                        address: '江阴路101号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '外滩街道',
                    service: {
                        name: '外滩街道社区事务受理中心',
                        tel: '021-63295277',
                        address: '河南中路568号',
                        time: '周一至周日 8:30-16:30 '
                    },
                    police: {
                        name: '外滩派出所',
                        tel: '021-63280123',
                        address: '天津路195弄50号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '外滩街道社区医院',
                        tel: '021-63526990',
                        address: '宁波路321号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '淮海中路街道',
                    service: {
                        name: '淮海中路街道社区事务受理中心',
                        tel: '021-53832593',
                        address: '马当路349号',
                        time: '周一至周日 上午8：30--11:30 下午13:00-16:30(法定假日除外) '
                    },
                    police: {
                        name: '淮海中路街道派出所',
                        tel: '021-53060595',
                        address: '普安路177号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '淮海中路街道社区卫生服务中心',
                        tel: '021-63858244',
                        address: '淡水路285号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '老西门街道',
                    service: {
                        name: '老西门街道社区事务受理中心',
                        tel: '021-63769098',
                        address: '大吉路71号',
                        time: '周一至周日：8：30—16：30（国定假日除外）'
                    },
                    police: {
                        name: '老西门派出所',
                        tel: '021-63280123',
                        address: '林荫路77号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '老西门街道社区卫生服务中心',
                        tel: '021-63779907',
                        address: '学前街81号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '五里桥街道',
                    service: {
                        name: '五里桥街道社区事务受理中心',
                        tel: '021-53013030',
                        address: '黄浦区瞿溪路768号',
                        time: '周一至周日：8：30—16：30（国定假日除外）'
                    },
                    police: {
                        name: '五里桥派出所',
                        tel: '021-63010589',
                        address: '中山南一路1109弄3号楼',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '五里桥街道社区卫生服务中心',
                        tel: '021-53012200',
                        address: '瞿溪路987号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '半淞园路街道',
                    service: {
                        name: '半淞园路街道社区事务受理中心',
                        tel: '021-63122105',
                        address: '黄浦区西藏南路1360号',
                        time: '周一至周日：8：30—16：30（国定假日除外）'
                    },
                    police: {
                        name: '半淞园派出所',
                        tel: '021-63280123',
                        address: '陆家浜路338号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '半淞园路街道社区卫生服务中心',
                        tel: '021-53072255',
                        address: '西藏南路1350号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '豫园街道',
                    service: {
                        name: '豫园街道社区事务受理中心',
                        tel: '021-63365917',
                        address: '梧桐路50号',
                        time: '周一至周日：8：30—16：30（国定假日除外）'
                    },
                    police: {
                        name: '豫园派出所',
                        tel: '021-23034754',
                        address: '方滨中路718号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '豫园街道社区卫生服务中心',
                        tel: '021-23210505',
                        address: '中华路1525号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '小东门街道',
                    service: {
                        name: '小东门街道社区事务受理中心',
                        tel: '021-63325801',
                        address: '黄浦区白渡路252号',
                        time: '周一至周日：8：30—16：30（国定假日除外）'
                    },
                    police: {
                        name: '小东门派出所',
                        tel: '021-63280123',
                        address: '中华路581号（丰记码头街116号）',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '小东门街道社区卫生服务中心',
                        tel: '021-63770202',
                        address: '光启南路225号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '瑞金二路街道',
                    service: {
                        name: '瑞金二路街道社区事务受理中心',
                        tel: '021-53829022',
                        address: '皋兰路6号',
                        time: '周一至周日 8:30—16:30（国定假日除外）'
                    },
                    police: {
                        name: '瑞金二路派出所',
                        tel: '021-53863868',
                        address: '淮海中路505号',
                        time: '周一至周五 上午 8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '瑞金二路街道社区卫生服务中心',
                        tel: '021-54653032',
                        address: '陕西南路147号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '打浦桥街道',
                    service: {
                        name: '打浦桥街道社区事务受理中心',
                        tel: '021-63041102',
                        address: '南塘浜路103号',
                        time: '周一至周日：8：30—16：30（国定假日除外）'
                    },
                    police: {
                        name: '打浦桥派出所',
                        tel: '021-63018716',
                        address: '斜土路315号',
                        time: '周一至周五 上午 8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '打浦桥街道社区卫生服务中心',
                        tel: '021-63059595',
                        address: '丽园路712-1号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }
            ]
        }, {
            district: '徐汇区',
            streets: [
                {
                    name: '湖南路街道 ',
                    service: {
                        name: '湖南路街道社区事务受理中心',
                        tel: '021-64377524',
                        address: '淮海中路1788号',
                        time: '周一至周日8：30——17：00（法定节假日除外）'
                    },
                    police: {
                        name: '湖南路派出所',
                        tel: '021-64370540',
                        address: '江阳南路203号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '湖南街道社区卫生中心',
                        tel: '',
                        address: '徐汇区乌鲁木齐中路247号3楼',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '天平路街道',
                    service: {
                        name: '天平路街道社区事务受理中心',
                        tel: '021-64673312',
                        address: '衡山路17弄1号',
                        time: '周一至周日8：30——17：01（法定节假日除外）'
                    },
                    police: {
                        name: '天平路派出所',
                        tel: '021-64336776',
                        address: '衡山路696弄1号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '天平路街道社区卫生服务中心',
                        tel: '021-64319642',
                        address: '太原路110号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '枫林路街道',
                    service: {
                        name: '枫林路街道街道社区事务受理中心',
                        tel: '021-64382999',
                        address: '中山南二路857号',
                        time: '周一至周日8：30——17：02（法定节假日除外）'
                    },
                    police: {
                        name: '枫林路派出所',
                        tel: '021-64189900',
                        address: '双峰路396号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '枫林路街道社区卫生服务中心',
                        tel: '021-64382999',
                        address: '双峰路450号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '徐家汇街道',
                    service: {
                        name: '徐家汇街道社区事务受理中心',
                        tel: '021-64417390',
                        address: '斜土路2431号',
                        time: '周一至周日 上午8：30—11:30；下午1:30—5:00'
                    },
                    police: {
                        name: '徐家汇派出所',
                        tel: '021-64380527',
                        address: '零陵路801号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '徐家汇街道社区卫生服务中心',
                        tel: '021-64479206',
                        address: '广元西路349号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '斜土路街道',
                    service: {
                        name: '斜土路街道社区事务受理中心',
                        tel: '021-64045999',
                        address: '茶陵路38号',
                        time: '周一至周日8:30-17:00'
                    },
                    police: {
                        name: '斜土路派出所',
                        tel: '021-64042433',
                        address: '零陵路51号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '斜土路街道社区卫生服务中心',
                        tel: '021-64042727',
                        address: '零陵北路2号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '长桥路街道',
                    service: {
                        name: '长桥路街道社区事务受理中心',
                        tel: '021-64771771',
                        address: '罗秀路616号',
                        time: '周一至周日8：30——17：00（法定节假日除外）'
                    },
                    police: {
                        name: '长桥新村派出所',
                        tel: '021-64102445',
                        address: '罗香路100号 （龙川路646号）',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '长桥路街道社区卫生服务中心',
                        tel: '021-64530038',
                        address: '龙川北路9号(龙川北路上中路)',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '漕河泾街道',
                    service: {
                        name: '漕河泾街道社区事务受理中心',
                        tel: '021-54480560',
                        address: '冠生园路211号',
                        time: '周一至周五8:30-17:00；11:30-1:30值班（办理部分业务）；周六、周日8:30-17:00（办理部分业务），11:30-1:30休息（以上受理时间法定节假日除外）'
                    },
                    police: {
                        name: '漕河泾派出所',
                        tel: '021-54480560',
                        address: '康健路80号 （南宁路668号）',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '漕河泾街道社区卫生服务中心',
                        tel: '021-54113581',
                        address: '三江路宾阳路38号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '虹梅路街道',
                    service: {
                        name: '虹梅路街道社区事务受理中心',
                        tel: '021-34207920',
                        address: '虹梅路2019号',
                        time: '周一至周日8：30——17：00（法定节假日除外）'
                    },
                    police: {
                        name: '虹梅派出所',
                        tel: '021-64369873',
                        address: '虹漕路7号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '虹梅路街道社区卫生服务中心',
                        tel: '021-54486140',
                        address: '漕宝路1001号(近虹梅路)',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '康健新村街道',
                    service: {
                        name: '康健新村街道社区事务受理中心',
                        tel: '021-54210576',
                        address: '浦北路268号',
                        time: '周一至周日 上午8:30-11:30；下午13:30-17:00'
                    },
                    police: {
                        name: '康健新村派出所',
                        tel: '021-64362677',
                        address: '桂林东街201号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '康健新村街道社区卫生服务中心',
                        tel: '021-54181223',
                        address: '康健新村江安路88号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '田林路街道',
                    service: {
                        name: '田林路街道社区事务受理中心',
                        tel: '021-64825656',
                        address: '宜山路655弄3号',
                        time: '周一至周日8:30-17:00（周六、周日及法定节假日11:30-13:30不办理业务）'
                    },
                    police: {
                        name: '田林新村派出所',
                        tel: '021-64366396',
                        address: '宜山路655弄3号田林14村120号 （柳州路688号）',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '田林路街道社区卫生服务中心',
                        tel: '021-64751150',
                        address: '柳州路500号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '凌云路街道',
                    service: {
                        name: '凌云路街道社区事务受理中心',
                        tel: '021-64552736',
                        address: '老沪闵路1039弄48号',
                        time: '周一至周日8：30——17：00（法定节假日除外）'
                    },
                    police: {
                        name: '凌云路派出所',
                        tel: '021-64530587',
                        address: '凌云路33号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '凌云路街道社区卫生服务中心',
                        tel: '021-64774811',
                        address: '凌云路99号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '龙华街道',
                    service: {
                        name: '龙华街道社区事务受理中心',
                        tel: '021-54121059',
                        address: '天钥桥南路399号',
                        time: '周一至周日8：30——17：00（法定节假日除外）'
                    },
                    police: {
                        name: '龙华派出所',
                        tel: '021-23038627',
                        address: '龙华路2796号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '龙华街道社区卫生服务中心',
                        tel: '021-64560088',
                        address: '龙华西路249号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '华泾镇',
                    service: {
                        name: '华泾镇社区事务受理中心',
                        tel: '021-54821212',
                        address: '华泾路505号',
                        time: '周一至周日8:30-17:00（法定节假日除外)'
                    },
                    police: {
                        name: '华泾派出所',
                        tel: '021-54829900',
                        address: '龙吴路2449号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '华泾镇社区卫生服务中心',
                        tel: '021-64960088',
                        address: '建华路180号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }
            ]
        }, {
            district: '长宁区',
            streets: [
                {
                    name: '华阳路街道',
                    service: {
                        name: '华阳路街道社区事务受理中心',
                        tel: '021-62266220',
                        address: '长宁路396弄79号',
                        time: '周一至周日8：30-16：30（法定节假日除外）'
                    },
                    police: {
                        name: '华阳路派出所',
                        tel: '021-62525767',
                        address: '定西路1291号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '华阳路街道卫生服务中心',
                        tel: '021-62522350',
                        address: '华阳路225',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '新华路街道',
                    service: {
                        name: '新华路街道社区事务受理中心',
                        tel: '021-62941011',
                        address: '法华镇路521号',
                        time: '周一至周日8：30-16：30（法定节假日除外）'
                    },
                    police: {
                        name: '新华路派出所',
                        tel: '021-23030010',
                        address: '法华镇路475号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '新华路街道卫生服务中心',
                        tel: '021-62815450',
                        address: '华山路1467号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '江苏路街道',
                    service: {
                        name: '江苏路街道社区事务受理中心',
                        tel: '021-62256600',
                        address: '江苏路563弄8号',
                        time: '周一至周五 8:30－16:30 ；周六至周日 上午8:30－11:30，下午13:30－16:30（法定节假日除外）'
                    },
                    police: {
                        name: '江苏路派出所',
                        tel: '021-62106334',
                        address: '利西路108号 （愚岩路1177号）',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '江苏街道社区卫生服务中心',
                        tel: '021-62128666',
                        address: '武夷路320弄4号(近定西路)',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '天山路街道',
                    service: {
                        name: '天山路街道社区事务受理中心',
                        tel: '021-62281033',
                        address: '娄山关路天山二村64号乙',
                        time: '周一至周日8：30-16：30（法定节假日除外）'
                    },
                    police: {
                        name: '天山路派出所',
                        tel: '021-62598760',
                        address: '紫云路365号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '天山路街道社区卫生服务中心',
                        tel: '021-62749020',
                        address: '娄山关路天山四村122号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '周家桥街道',
                    service: {
                        name: '周家桥街道社区事务受理中心虹桥街道社区事务受理中心',
                        tel: '021-52061155',
                        address: '云雾山路551弄48号',
                        time: '周一至周日8：30-16：30（法定节假日除外）'
                    },
                    police: {
                        name: '周家桥派出所',
                        tel: '021-62598037',
                        address: '长宁路1448弄8号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '周家桥街道社区卫生服务中心',
                        tel: '021-52061155',
                        address: '云雾山路551弄48号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '虹桥街道',
                    service: {
                        name: '虹桥街道社区事务受理中心',
                        tel: '021-22850900',
                        address: '中山西路1030弄51号',
                        time: '周一至周五8:30-16:30 双休日8:30-11:30 13:30-16:30（法定节假日除外）'
                    },
                    police: {
                        name: '虹桥路派出所',
                        tel: '021-23030310',
                        address: '虹桥路1151号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '虹桥街道社区卫生服务中心',
                        tel: '021-62759200',
                        address: '虹桥路961弄4号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '仙霞新村街道',
                    service: {
                        name: '仙霞新村街道社区事务受理中心',
                        tel: '021-62959244',
                        address: '虹古路206号',
                        time: '周一至周日8：30-16：30（法定节假日除外）'
                    },
                    police: {
                        name: '仙霞路派出所',
                        tel: '021-62340769',
                        address: '芙蓉江路100弄2号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '仙霞新村街道社区卫生服务中心',
                        tel: '021-62743010',
                        address: '芙蓉江路140号（芙蓉江路茅台路）',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '程家桥街道',
                    service: {
                        name: '程家桥街道社区事务受理中心',
                        tel: '021-22300100',
                        address: '虹桥路2282号',
                        time: '周一至周日8：30-16：30（法定节假日除外）'
                    },
                    police: {
                        name: '程家桥派出所',
                        tel: '021-23030360',
                        address: '哈密路1721号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '程家桥街道社区卫生服务中心',
                        tel: '021-62426685',
                        address: '延安西路3499号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '北新泾街道',
                    service: {
                        name: '北新泾街道社区事务受理中心',
                        tel: '021-52188321',
                        address: '新泾一村144号',
                        time: '周一至周日8：30-16：30（法定节假日除外）'
                    },
                    police: {
                        name: '北新泾派出所',
                        tel: '021-62389606',
                        address: '平塘路205号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '北新泾街道社区卫生服务中心',
                        tel: '021-52600403',
                        address: '北渔路111号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '新泾镇',
                    service: {
                        name: '新泾镇社区事务受理中心',
                        tel: '021-52160606',
                        address: '新泾镇泉口路66号',
                        time: '周一至周日8：30-16：31（法定节假日除外）'
                    },
                    police: {
                        name: '新泾派出所',
                        tel: '021-52199033',
                        address: '剑河路500号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '新泾镇社区卫生服务中心',
                        tel: '021-52600276',
                        address: '淞虹路507号2楼',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }
            ]
        }, {
            district: '静安区',
            streets: [
                {
                    name: '江宁路街道',
                    service: {
                        name: '江宁路街道社区事务受理中心',
                        tel: '021-62668866',
                        address: '常德路818号',
                        time: '周一至周五8：30—17：00 周六、周日9：30—15:30（全年无休）'
                    },
                    police: {
                        name: '江宁路派出所',
                        tel: '021-2217831',
                        address: '新闸路1332号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '江宁路街道社区卫生服务中心',
                        tel: '021-62668866',
                        address: '康定路733弄70号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '静安寺街道',
                    service: {
                        name: '静安寺街道社区事务受理中心',
                        tel: '021-54036120',
                        address: '常熟路115号',
                        time: '周一至周五8：30—17：00 周六、周日9：30—15:30（法定节假日除外）'
                    },
                    police: {
                        name: '静安寺派出所',
                        tel: '021-62888078',
                        address: '万航渡路55弄5号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '静安寺街道社区卫生服务中心',
                        tel: '021-62176060',
                        address: '新闸路1729号(近胶州路)',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '南京西路街道',
                    service: {
                        name: '南京西路街道社区事务受理中心',
                        tel: '021-62897060',
                        address: '延安中路955弄67号',
                        time: '周一至周五:上午8:30—11:30；下午：14：00--17：00周六、周日：9:30—15:30（法定节假日除外）'
                    },
                    police: {
                        name: '南京西路派出所',
                        tel: '021-62476100',
                        address: '延安中路931号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '南京西路街道社区卫生服务中心',
                        tel: '021-63182117',
                        address: '成都北路165号(威海路)',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '曹家渡街道',
                    service: {
                        name: '曹家渡街道社区事务受理中心',
                        tel: '021-62112892',
                        address: '万航渡路676弄46号',
                        time: '周一至周五8：30—17：00 周六、周日9：30—15:30（法定节假日除外）'
                    },
                    police: {
                        name: '曹家渡派出所',
                        tel: '021-62522075',
                        address: '万航渡路684号（武定西路1368号）',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '曹家渡街道社区卫生服务中心',
                        tel: '021-62268811',
                        address: '万航渡路858弄5号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '石门二路街道',
                    service: {
                        name: '石门二路街道社区事务受理中心',
                        tel: '021-62675858',
                        address: '静安区武定路139号',
                        time: '周一至周五上午8：30-11：30，下午13：30—17：00；周六、周日9：30-15：30（法定节假日除外）'
                    },
                    police: {
                        name: '石门二路派出所',
                        tel: '021-62568567',
                        address: '大田路351号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '石门二路街道社区卫生服务中心',
                        tel: '021-62563921',
                        address: '山海关路456号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }
            ]
        }, {
            district: '虹口区',
            streets: [
                {
                    name: '四川北路街道',
                    service: {
                        name: '四川北路街道社区事务受理服务中心',
                        tel: '021-56661380',
                        address: '新广路296号一楼',
                        time: '周一至周五8:30-16:30 周六至周日9:00-16:00（法定节假日除外）'
                    },
                    police: {
                        name: '四川北路派出所',
                        tel: '021-56665799',
                        address: '溧阳路1338号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '四川北路街道社区卫生服务中心',
                        tel: '021-51536084',
                        address: '新广路296号一楼',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '提篮桥街道',
                    service: {
                        name: '提篮桥街道社区事务受理服务中心',
                        tel: '021-65853300',
                        address: '新建路195号',
                        time: '周一至周四8:30-16:30 周五8:30-15:00 周六至周日9:00-16:00（法定节假日除外）'
                    },
                    police: {
                        name: '提篮桥派出所',
                        tel: '021-63242611',
                        address: '虹口区九龙路475号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '提篮桥街道社区卫生服务中心',
                        tel: '021-65415988',
                        address: '霍山路327号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '欧阳路街道',
                    service: {
                        name: '欧阳路街道社区事务受理服务中心',
                        tel: '021-65222978',
                        address: '曲阳路483弄1—3号',
                        time: '周一至周五 8:30-16:30 周六、周日 9:00-16:00（法定节假日除外）'
                    },
                    police: {
                        name: '欧阳路派出所',
                        tel: '021-65222978',
                        address: '天宝西路277号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '欧阳路街道社区卫生服务中心',
                        tel: '021-51296900',
                        address: '四平路421弄20号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '广中路街道',
                    service: {
                        name: '广中路街道社区事务受理服务中心',
                        tel: '021-51812222',
                        address: '水电路120号',
                        time: '周一至周五 8:30-16:30 周六、周日 9:00-16:00（法定节假日除外）'
                    },
                    police: {
                        name: '广中路派出所',
                        tel: '021-56961489',
                        address: '中山北一路208号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '广中路街道社区卫生服务中心',
                        tel: '021-51812222',
                        address: '广灵一路80号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '凉城新村街道',
                    service: {
                        name: '凉城新村街道社区事务受理服务中心',
                        tel: '021-65290666',
                        address: '凉城路465弄41号甲',
                        time: '周一至周五8:30—11:30；13:30—16:30；双休日：9:00—11:30；13:30—16:00（法定节假日除外）'
                    },
                    police: {
                        name: '凉城新村派出所',
                        tel: '021-65296693',
                        address: '凉城路665号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '凉城新村街道社区卫生服务中心',
                        tel: '021-65291853',
                        address: '凉城路854号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '嘉兴路街道',
                    service: {
                        name: '嘉兴路街道社区事务受理服务中心',
                        tel: '021-65158800',
                        address: '三河路388号',
                        time: '周一至周五 8:30—16:30周六、周日9:00-16:00（国定节假日除外）'
                    },
                    police: {
                        name: '嘉兴路派出所',
                        tel: '021-23031250',
                        address: '高阳路701号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '嘉兴路街道社区卫生服务中心',
                        tel: '021-65018435',
                        address: '虹口区瑞虹路480号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '曲阳路街道',
                    service: {
                        name: '曲阳路街道社区事务受理服务中心',
                        tel: '021-35391600',
                        address: '伊敏河路88号',
                        time: '周一至周五 8:30-16:30 周六、周日 9:00-16:00（法定节假日除外）'
                    },
                    police: {
                        name: '曲阳路派出所',
                        tel: '021-65552848',
                        address: '巴林路56号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '曲阳路街道社区卫生服务中心',
                        tel: '021-35391600',
                        address: '巴林路78号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '江湾镇街道',
                    service: {
                        name: '江湾镇街道社区事务受理服务中心',
                        tel: '021-65167111',
                        address: '奎照路280号',
                        time: '周一至周四上午8:30-11:30；下午1:00-:4:30（夏令时2：00-4:30）；周五上午8:30-11:30；下午1:00-3:30 双休日上午9:00-11:00；下午1:00-4:00'
                    },
                    police: {
                        name: '江湾派出所',
                        tel: '021-65167111',
                        address: '万安路745号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '江湾镇街道社区卫生服务中心',
                        tel: '021-55398857',
                        address: '新市南路1191号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }
            ]
        }, {
            district: '闸北区',
            streets: [
                {
                    name: '天目西路街道',
                    service: {
                        name: '天目西路街道社区事务受理中心',
                        tel: '021-36392197',
                        address: '沪太路150号',
                        time: '周一至周五7：45-18：00 双休日9：00-16：30全年无休（国定节假日除外）'
                    },
                    police: {
                        name: '天目西路派出所',
                        tel: '021-63800364',
                        address: '恒丰路77号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '天目西路街道社区卫生服务中心',
                        tel: '021-63540602',
                        address: '梅园路111号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '北站街道',
                    service: {
                        name: '北站街道社区事务受理中心',
                        tel: '021-63809258',
                        address: '南星路40号',
                        time: '周一至周五8:30-11:30，13:30-16:30/夏令时8:30-11:30，14:00-16:30 ； 周六、周日9:00-11:30，13:30-16:00/夏令时9：00-11:30，14:00-16:00'
                    },
                    police: {
                        name: '北站派出所',
                        tel: '021-63933628',
                        address: '浙江北路321号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '北站街道社区卫生服务中心',
                        tel: '021-63246792',
                        address: '海宁路1020号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '宝山路街道',
                    service: {
                        name: '宝山路街道社区事务受理中心',
                        tel: '021-56301203',
                        address: '宝昌路519号',
                        time: '周一至周五8:30-16:30;周六、周日上午9:00-11:00,下午14:00-16:00'
                    },
                    police: {
                        name: '宝山路派出所',
                        tel: '021-56629330',
                        address: '青云路481号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '宝山路街道社区卫生服务中心',
                        tel: '021-56301203',
                        address: '天通庵路51号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '芷江西路街道',
                    service: {
                        name: '芷江西路街道社区事务受理中心',
                        tel: '021-66583382',
                        address: '芷江西路151号',
                        time: '周一至周日8：30——11:30，13：30——16:30 (夏令时14:00-16:30)'
                    },
                    police: {
                        name: '芷江西路派出所',
                        tel: '021-56906596',
                        address: '芷江西路163号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '芷江西路街道社区卫生服务中心',
                        tel: '021-56629125',
                        address: '芷江西路335号(近大统路)',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '共和新路街道',
                    service: {
                        name: '共和新路街道事务受理中心',
                        tel: '021-56039488',
                        address: '平型关路487号',
                        time: '周一至周日上午 8：30—11：30 下午 13：30—16：30'
                    },
                    police: {
                        name: '共和新路派出所',
                        tel: '021-56626109',
                        address: '共和新路1302号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '共和新路街道社区卫生服务中心',
                        tel: '021-56382020',
                        address: '洛川东路151-1号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '大宁路街道',
                    service: {
                        name: '大宁路街道社区事务受理中心',
                        tel: '021-56658320',
                        address: '彭江路188号',
                        time: '周一至周五9:00-16：30 周六、周日上午9：00-11：30 下午13：30-16：30（国家法定节假日除外）'
                    },
                    police: {
                        name: '大宁路派出所',
                        tel: '021-56653233',
                        address: '共和新路2299号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '大宁路街道社区卫生服务中心',
                        tel: '021-56339696',
                        address: '广延路101号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '彭浦新村街道',
                    service: {
                        name: '彭浦新村街道社区事务受理中心',
                        tel: '021-56478800',
                        address: '安泽路78号',
                        time: '周一至周日上午8:30—11:30 下午13:30—16:30 (国家法定节假日除外)'
                    },
                    police: {
                        name: '彭浦新村派出所',
                        tel: '021-56478800',
                        address: '彭浦新村161号甲（平胜路921号）',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '彭浦新村街道社区卫生服务中心',
                        tel: '021-56911536',
                        address: '平顺路15号近闻喜路',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '临汾路街道',
                    service: {
                        name: '临汾路街道社区事务受理中心',
                        tel: '021-66987770',
                        address: '临汾路335号',
                        time: '周一至周五8:00-18:00  双休日上午9:00-11:30  下午1:30-4:30'
                    },
                    police: {
                        name: '临汾路派出所',
                        tel: '021-56884356',
                        address: '景风路398号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '临汾路街道社区卫生服务中心',
                        tel: '021-56831110',
                        address: '临汾路385号(近岭南路)',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '彭浦镇',
                    service: {
                        name: '彭浦镇社区事务受理中心',
                        tel: '021-56772537',
                        address: '灵石路725号丙',
                        time: '周一至周日上午8:30-11:30,下午13:30-16:30（国家法定节假日除外）'
                    },
                    police: {
                        name: '彭浦镇派出所',
                        tel: '021-56771683',
                        address: '灵石路731号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '彭浦镇社区卫生服务中心',
                        tel: '021-56651889',
                        address: '灵石路789号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }
            ]
        }, {
            district: '崇明县',
            streets: [
                {
                    name: '城桥镇',
                    service: {
                        name: '城桥镇社区事务受理中心',
                        tel: '021-69617130',
                        address: '城桥镇寒山寺路164号',
                        time: '周一至周五 8:30-17:00（国定假除外）周六、周日8:30-11:15 13:30-17:00（国定假除外）'
                    },
                    police: {
                        name: '城桥镇派出所',
                        tel: '021-59612142',
                        address: '城桥镇一江山路159号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '城桥镇社区卫生服务中心',
                        tel: '021-69620391',
                        address: '花鸟路309号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '堡镇镇',
                    service: {
                        name: '堡镇镇新河镇社区事务受理中心社区事务受理中心',
                        tel: '021-59410413',
                        address: '堡镇化工路17号',
                        time: '周一至周日上午8:00-11:15 下午13:00-16:00（国定假除外）'
                    },
                    police: {
                        name: '堡镇镇派出所',
                        tel: '021-59419707',
                        address: '大通路318号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '堡镇社区卫生服务中心',
                        tel: '021-59423184',
                        address: '达山路377号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '新河镇',
                    service: {
                        name: '新河镇社区事务受理中心',
                        tel: '021-59687397',
                        address: '新河镇新申路801号',
                        time: '周一至周日 上午8:30~11:30 下午13:30~16:30（国定假除外）'
                    },
                    police: {
                        name: '新河镇派出所',
                        tel: '021-59681979',
                        address: '新开河路627号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '新河镇社区卫生服务中心',
                        tel: '021-59681559',
                        address: '康复路219号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '庙镇镇',
                    service: {
                        name: '庙镇镇社区事务受理中心',
                        tel: '021-59365379',
                        address: '剧场路6号',
                        time: '周一至周日8:30-16:00（国定假除外）'
                    },
                    police: {
                        name: '庙镇镇派出所',
                        tel: '021-59361610',
                        address: '鸿海公路1803号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '庙镇镇社区卫生服务中心',
                        tel: '021-69360024',
                        address: '剧场路6号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '竖新镇',
                    service: {
                        name: '竖新镇社区事务受理中心',
                        tel: '021-59495305',
                        address: '竖新镇响椿路60号',
                        time: '周一至周日8:30-16:00（国定假除外）'
                    },
                    police: {
                        name: '竖新镇派出所',
                        tel: '021-59495305',
                        address: '竖新镇响椿路60号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '竖新镇社区卫生服务中心',
                        tel: '021-59491828',
                        address: '响椿路98号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '向化镇',
                    service: {
                        name: '向化镇社区事务受理中心',
                        tel: '021-59441064',
                        address: '向化大街149号',
                        time: '周一至周五8:00-11:00 13:30-16:30 周六、周日上午8:30-11:00 下午13:30-15:30 (国定节假日除外）'
                    },
                    police: {
                        name: '向化镇派出所',
                        tel: '021-59441146',
                        address: '陈彷公路4158号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '向化镇社区卫生服务中心',
                        tel: '021-59443756',
                        address: '向化大街149号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '三星镇',
                    service: {
                        name: '三星镇社区事务受理中心',
                        tel: '021-39600024',
                        address: '三星镇宏海路4291号',
                        time: '周一至周日 8:00-16:00 (国定节假日除外）'
                    },
                    police: {
                        name: '三星镇派出所',
                        tel: '021-59300506',
                        address: '海桥公路2号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '三星镇社区卫生服务中心',
                        tel: '021-59601731',
                        address: '宏海公路4235号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '港沿镇',
                    service: {
                        name: '港沿镇社区事务受理中心',
                        tel: '021-59462567',
                        address: '港沿镇建联路1138号 ',
                        time: '周一至周日8:30-16:30(国定节假日除外）'
                    },
                    police: {
                        name: '港沿镇派出所',
                        tel: '021-59461459',
                        address: '港沿镇港沿公路1002号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '港沿镇社区卫生服务中心',
                        tel: '021-59463914',
                        address: '港沿公路1151号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '中兴镇',
                    service: {
                        name: '中兴镇社区事务受理中心',
                        tel: '021-39440027',
                        address: '中兴镇广福路37号',
                        time: '周一至周日上午8:00-11:00 13:30-16:30(国定节假日除外）'
                    },
                    police: {
                        name: '中兴镇派出所',
                        tel: '021-69444321',
                        address: '中兴镇广福路37号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '中兴镇社区卫生服务中心',
                        tel: '021-69445321',
                        address: '陈彷公路2490号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '陈家镇',
                    service: {
                        name: '陈家镇社区事务受理中心',
                        tel: '021-59403665',
                        address: '陈家镇北城公路1454号',
                        time: '周一至周日 8:00-11:00 13:00-16:00(国定节假日除外）'
                    },
                    police: {
                        name: '陈家镇派出所',
                        tel: '021-39636458',
                        address: '安振路188弄1号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '陈家镇社区卫生服务中心',
                        tel: '021-59438734',
                        address: '陈彷公路250号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '绿华镇',
                    service: {
                        name: '绿华镇社区事务受理中心',
                        tel: '021-59351568',
                        address: '绿华镇嘉华路8号',
                        time: '周一至周日上午8:30-11:30 下午13:30-16:30(国定节假日除外）'
                    },
                    police: {
                        name: '绿华镇派出所',
                        tel: '021-59351635',
                        address: '新建公路634号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '绿华镇社区卫生服务中心',
                        tel: '021-59351221',
                        address: '绿华镇东福路502号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '港西镇',
                    service: {
                        name: '港西镇社区事务受理中心',
                        tel: '021-59671520',
                        address: '港西镇三双公路1573号 ',
                        time: '周一至周日8:30-16:30 (国定节假日除外 ）'
                    },
                    police: {
                        name: '港西镇派出所',
                        tel: '021—59671532',
                        address: '港东公路887弄6号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '港西镇社区卫生服务中心',
                        tel: '021-59671280',
                        address: '三双公路1581弄126号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '建设镇',
                    service: {
                        name: '建设镇社区事务受理中心',
                        tel: '021-39628027',
                        address: '建设镇建星路108号 ',
                        time: '周一至周日8:30-16:30 (国定节假日除外 ）'
                    },
                    police: {
                        name: '建设镇派出所',
                        tel: '021-59333680',
                        address: '建星路109号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '建设镇社区卫生服务中心',
                        tel: '021-59331650',
                        address: '建设镇白钥村1269号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '新村乡',
                    service: {
                        name: '新村乡社区事务受理中心',
                        tel: '021-59650090',
                        address: '新村乡星村公路2107号',
                        time: '周一至周日8:30-16:30 (国定节假日除外 ）'
                    },
                    police: {
                        name: '新村乡派出所',
                        tel: '021-59650598',
                        address: '新中村新跃160号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '新村乡社区卫生服务中心',
                        tel: '021-59650812',
                        address: '新村乡界河镇星村公路2118号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '长兴乡',
                    service: {
                        name: '长兴镇社区事务受理中心',
                        tel: '021-56854939',
                        address: '长兴镇凤凰街5号',
                        time: '周一至周五8:00--16:00周六周日8:00--11:00 13:00--16:00 (国定节假日除外 ）'
                    },
                    police: {
                        name: '长兴乡派出所',
                        tel: '021-56851678',
                        address: '长兴乡凤滨路88号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '长兴乡社区卫生服务中心',
                        tel: '021-56851895',
                        address: '长兴岛凤南路59号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '横沙乡',
                    service: {
                        name: '横沙乡社区事务受理中心',
                        tel: '021-56899074',
                        address: '横沙乡新环路57号',
                        time: '周一至周五8:30-16:30 周六、周日上午8:30-11:30 下午13:00-16:30(国定节假日除外 ）'
                    },
                    police: {
                        name: '横沙乡派出所',
                        tel: '021-56890864',
                        address: '民东路1588号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '横沙乡社区卫生服务中心',
                        tel: '021-56890396',
                        address: '民东路1573号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '东平镇',
                    service: {
                        name: '东平镇社区事务受理服务中心',
                        tel: '021—59666777',
                        address: '东平镇长江农场长江大街黄河路口',
                        time: '周一至周日 上午8:30—11:30 下午13:30—16:30(国定节假日除外 ）'
                    },
                    police: {
                        name: '崇明县公安局东旺沙边防派出所',
                        tel: '021—59471190',
                        address: '东平镇东旺西路东苑新村东50米',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '东平镇社区卫生服务中心',
                        tel: '021-59666319',
                        address: '北沿公路1725弄550号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '新海镇',
                    service: {
                        name: '新海镇社区事务受理服务中心',
                        tel: '021-59655101',
                        address: '新海镇海展路80号',
                        time: '周一至周日上午8:30-下午16:00(国定节假日除外 ）'
                    },
                    police: {
                        name: '新海镇派出所',
                        tel: '021-59655712',
                        address: '崇明区海辉路328',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '新海镇社区卫生服务中心',
                        tel: '021-59655091',
                        address: '北沿公路3338号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }
            ]
        }, {
            district: '杨浦区',
            streets: [
                {
                    name: '定海路街道',
                    service: {
                        name: '定海路街道社区事务受理中心',
                        tel: '021-65207539',
                        address: '长阳路3066号',
                        time: '周一至周日 上午8:30-11:30 下午13:30-17:00'
                    },
                    police: {
                        name: '定海路派出所',
                        tel: '021-65431000',
                        address: '河间路1500号  ',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '定海路街道卫生服务中心',
                        tel: '021-65665959',
                        address: '爱国路77号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '大桥街道',
                    service: {
                        name: '大桥街道社区事务受理中心',
                        tel: '021-65701838',
                        address: '平凉路1730号',
                        time: '周一至周日上午8：30-11:30 下午13:30-17:00 夏令时下午14:00-17:00'
                    },
                    police: {
                        name: '大桥派出所',
                        tel: '021-65431000',
                        address: '宁国路19号 （长阳路2143号）',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '大桥街道卫生服务中心',
                        tel: '021-65184300',
                        address: '长阳路1389弄75甲',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '平凉路街道',
                    service: {
                        name: '平凉路街道社区事务受理中心',
                        tel: '021-65850951',
                        address: '吉林路18号',
                        time: '周一至周日上午8:30-11:30 下午13:30-17:00 夏令时下午14:00-17:00（国定节假日除外）'
                    },
                    police: {
                        name: '平凉路派出所',
                        tel: '021-22171400',
                        address: '通北路2号靠近杨树浦路',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '平凉路街道卫生服务中心',
                        tel: '021-65413658',
                        address: '平凉路335号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '江浦路街道',
                    service: {
                        name: '江浦路街道社区事务受理中心',
                        tel: '021-65853533',
                        address: '许昌路1150号',
                        time: '周一至周日 上午8:30-11:30 下午1:30-5:00（夏令时下午2:00-5:00)国定节假日除外'
                    },
                    police: {
                        name: '江浦路派出所',
                        tel: '021-22171200',
                        address: '飞虹路737号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '江浦路街道卫生服务中心',
                        tel: '021-65154702',
                        address: '许昌路1482号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '控江路街道',
                    service: {
                        name: '控江路街道社区事务受理中心',
                        tel: '021-55803280',
                        address: '周家嘴路3209号',
                        time: '周一至周日上午8:30-11:30 下午13:30-17:00 夏令时下午14:00-17:00（国定节假日除外）'
                    },
                    police: {
                        name: '控江路派出所',
                        tel: '021-22171040',
                        address: '周家嘴路2985号靠近黄信路口',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '控江路街道社区事务受理中心',
                        tel: '021-55803280',
                        address: '周家嘴路3209号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '殷行街道',
                    service: {
                        name: '殷行街道社区事务受理中心',
                        tel: '021-65063740',
                        address: '国和路1047号',
                        time: '周一至周日8：30-17：00（法定节假日除外）'
                    },
                    police: {
                        name: '殷行派出所',
                        tel: '021-22171320',
                        address: '包头路777号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '殷行街道卫生服务中心',
                        tel: '021-65320658',
                        address: '包头路999号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '长白新村街道',
                    service: {
                        name: '长白新村街道社区事务受理中心',
                        tel: '021-65482211',
                        address: '延吉东路107号',
                        time: '周一至周日 上午8:30-11:30 下午13:30-17:00（夏令时14:00-17:00）（国定节假日除外）'
                    },
                    police: {
                        name: '长白新村派出所',
                        tel: '021-22171080',
                        address: '延吉东路111号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '长白新村街道卫生服务中心',
                        tel: '021-55826072',
                        address: '松花江路15号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '延吉新村街道',
                    service: {
                        name: '延吉新村街道社区事务受理中心',
                        tel: '021-65482211',
                        address: '延吉中路77号',
                        time: '周一至周五  8:30-17:00  周六、周日08:30-11:30 13:30-17:00（国定节假日除外）'
                    },
                    police: {
                        name: '延吉新村派出所',
                        tel: '021-22171040',
                        address: '水丰路385号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '延吉新村街道卫生服务中心',
                        tel: '021-65301504',
                        address: '水丰路383号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '五角场街道',
                    service: {
                        name: '五角场街道社区事务受理中心',
                        tel: '021-55621137',
                        address: '政通路100弄11号',
                        time: '周一至周五8:30-17:00 周六、日8:30-11:30,13:30-17:00（国定节假日除外，夏令时另行通知）'
                    },
                    police: {
                        name: '五角场派出所',
                        tel: '021-65431000',
                        address: '国和路40号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '五角场街道社区卫生服务中心',
                        tel: '021-65364058',
                        address: '纪念路100号甲',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '四平路街道',
                    service: {
                        name: '四平路街道社区事务受理中心',
                        tel: '021-65145236',
                        address: '鞍山路158号',
                        time: '周一至周日 上午8：30-11：30下午13：30-17：00（国定节假日除外）'
                    },
                    police: {
                        name: '四平路派出所',
                        tel: '021-22171000',
                        address: '苏家屯路9号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '四平路街道卫生服务中心',
                        tel: '021-65134932',
                        address: '铁岭路39号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '新江湾城街道',
                    service: {
                        name: '新江湾城街道社区事务受理中心',
                        tel: '021-55130258',
                        address: '政悦路329号',
                        time: '周一至周日 上午8:30-11:30 ，下午13:30-17:00（夏令时下午14:00-17:00）（国定节假日除外）'
                    },
                    police: {
                        name: '新江湾城街道派出所',
                        tel: '021-22171488',
                        address: '政悦路333号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '殷行街道卫生服务中心',
                        tel: '021-65320658',
                        address: '包头路999号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '五角场镇',
                    service: {
                        name: '五角场镇社区事务受理服务中心',
                        tel: '021-65564636',
                        address: '国和路425号',
                        time: '周一至周日上午8:30-11:30，下午13:30-17:00（夏令时间周一至周日上午8:30-11:30，下午14:00-17:00）'
                    },
                    police: {
                        name: '五角场镇派出所',
                        tel: '021-65431000',
                        address: '政立路65号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '五角场镇社区卫生服务中心',
                        tel: '021-65490022',
                        address: '营口路760号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }
            ]
        }, {
            district: '普陀区',
            streets: [
                {
                    name: '长寿路街道',
                    service: {
                        name: '长寿街道社区事务受理服务中心',
                        tel: '021-62277887',
                        address: '普陀区胶州路1087号',
                        time: '周一至周五8:30-11:30 14：00-16:30 双休日9:00-11:30 13:30-16：30(国定节假日除外）'
                    },
                    police: {
                        name: '长寿路派出所',
                        tel: '021-22048050',
                        address: '常德路1399号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '长寿路街道社区卫生服务中心',
                        tel: '021-62993717',
                        address: '常德路1239号5楼',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '曹杨新村街道',
                    service: {
                        name: '曹杨新村街道社区事务受理服务中心',
                        tel: '021-62167000',
                        address: '枫桥路8号',
                        time: '周一至周日 上午8:30-11:30 下午1:30-4:30（国定节假日除外）夏令时下午2:00-4:30'
                    },
                    police: {
                        name: '曹杨新村派出所',
                        tel: '021-22048650',
                        address: '梅岭支路85弄30号 （ 朝阳路929号）',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '曹杨新村街道社区卫生服务中心',
                        tel: '021-62164506',
                        address: '兰溪路121号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '长风新村街道',
                    service: {
                        name: '长风新村街道社区事务受理服务中心',
                        tel: '021-62573789',
                        address: '枣阳路251弄99号',
                        time: '周一至周五 8 ：30-16：30 周六、周日：9:00-11:30 13：30-16：30（法定节假日除外） 夏令时：周六、周日：9：00-11：30 14：00-16：30（法定节假日除外）'
                    },
                    police: {
                        name: '长风新村派出所',
                        tel: '021-22048450',
                        address: '怒江路131弄100号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '长风新村街道社区卫生服务中心',
                        tel: '021-62656585',
                        address: '金沙江路906号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '宜川路街道',
                    service: {
                        name: '宜川路街道社区事务受理服务中心',
                        tel: '021-56080729',
                        address: '华阴路296号',
                        time: '周一至周五 8 ：30-16：30 周六、周日：9:00-11:30 13：30-16：30（法定节假日除外）夏令时周六、周日：9：00-11：30 14：00-16：31（法定节假日除外）'
                    },
                    police: {
                        name: '宜川新村派出所',
                        tel: '021-22048200',
                        address: '华阴路宜川六村110号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '宜川路街道社区卫生服务中心',
                        tel: '021-56096836',
                        address: '骊山路43号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '甘泉路街道',
                    service: {
                        name: '甘泉路街道社区事务受理服务中心',
                        tel: '021-66252255',
                        address: '宜君路9号',
                        time: '周一至周日上午8：30-11:30 下午13:30-16：30 6-9月夏令时下午14：00-16：30（国定节假日除外）'
                    },
                    police: {
                        name: '甘泉路派出所',
                        tel: '021-22048250',
                        address: '宜川路351弄31号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '甘泉路街道社区卫生服务中心',
                        tel: '021-56077640',
                        address: '平利路57号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '石泉路街道',
                    service: {
                        name: '石泉路街道社区事务受理服务中心',
                        tel: '021-60837528',
                        address: '宁强路25号b楼',
                        time: '周一至周五 8:30-11:30 13:30-16:30 双休日9:00-11:30 13:30-16:30（国家法定假日除外）'
                    },
                    police: {
                        name: '石泉路派出所',
                        tel: '021-52941493',
                        address: '岚皋路40弄8号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '石泉路街道社区卫生服务中心',
                        tel: '021-62148606',
                        address: '管弄路297号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '真如镇',
                    service: {
                        name: '真如镇社区事务受理服务中心',
                        tel: '021-52768994',
                        address: '铜川路1809号',
                        time: '周一至周日（国家法定节假日除外）上午8:30-11:30 下午13:30-16:30（夏令14:00-16:30）'
                    },
                    police: {
                        name: '真如镇派出所',
                        tel: '021-22048500',
                        address: '兰溪路990号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '真如镇社区卫生服务中心',
                        tel: '021-62654006',
                        address: '真如西村115号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '长征镇',
                    service: {
                        name: '长征镇社区事务受理服务中心',
                        tel: '021-62062200',
                        address: '清峪路12号(近清峪路)',
                        time: '周一至周五 8:30-16:30 周六、周日 9:00-11:30，13:30-16:30（国定节假日除外）'
                    },
                    police: {
                        name: '长征派出所',
                        tel: '021-22048550',
                        address: '梅岭北路1238号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '长征镇社区卫生服务中心',
                        tel: '021-52694803',
                        address: '千阳路209号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '桃浦镇',
                    service: {
                        name: '桃浦镇社区事务受理服务中心',
                        tel: '021-66267866',
                        address: '绿杨路225号',
                        time: '周一至周五 上午8:30-11:30 下午1:30-4:30 周六、周日：上午9:00-11:30 下午1:30-4:30（国定节假日除外）'
                    },
                    police: {
                        name: '桃浦派出所',
                        tel: '021-22048700',
                        address: '真南路靠近武威路1999号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '桃浦镇社区卫生服务中心',
                        tel: '021-66260808',
                        address: '雪松路302号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }
            ]
        }, {
            district: '宝山区',
            streets: [
                {
                    name: '吴淞街道',
                    service: {
                        name: '吴淞街道社区事务受理中心',
                        tel: '021-56572070',
                        address: '淞青路151号',
                        time: '周一至周五：8:30-17:00 周六、周日：8:30-11:00 13:30-16:30（法定节假日除外）'
                    },
                    police: {
                        name: '吴淞街道派出所',
                        tel: '021-56671069',
                        address: '淞兴西路201号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '吴淞街道社区卫生服务中心',
                        tel: '021-56580804',
                        address: '同济路313号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '张庙街道',
                    service: {
                        name: '张庙街道社区事务受理中心',
                        tel: '021-56762616',
                        address: '泗塘二村108号',
                        time: '周一至周五：上午：8:30-11:00 下午：13:00-16:30 周六、周日：上午：8:30-11:00 下午：13:00-15:00（国定假日除外）'
                    },
                    police: {
                        name: '张庙街道派出所',
                        tel: '021-56757899',
                        address: '虎林路236号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '泗塘社区卫生服务中心',
                        tel: '021-56757570',
                        address: '虎林路439号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '友谊路街道',
                    service: {
                        name: '友谊路街道社区事务受理中心',
                        tel: '021-56122006',
                        address: '永清路899号',
                        time: '周一至周五上午8：30-17：00 周六、周日上午8：30-11：00 下午13：00-16：30（国定假日除外）'
                    },
                    police: {
                        name: '友谊路街道派出所',
                        tel: '021-56608111',
                        address: '宝杨路628号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '友谊路街道社区卫生服务中心',
                        tel: '021-56107044',
                        address: '宝杨路333号(淞宝路口)',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '庙行镇',
                    service: {
                        name: '庙行镇社区事务受理中心',
                        tel: '021-56475979',
                        address: '长江西路2700号',
                        time: '周一至周五8:30-16:30 周六、周日上午8:30-11:30 下午13:00-16:30（国定假日除外）'
                    },
                    police: {
                        name: '庙行镇派出所',
                        tel: '021-56400846',
                        address: '康宁路2299号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '庙行镇社区卫生服务中心',
                        tel: '021-56477500',
                        address: '长江西路2700号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '罗店镇',
                    service: {
                        name: '罗店镇社区事务受理中心',
                        tel: '021-56865420',
                        address: '祁北东路209号',
                        time: '周一至周五8:30-16:30 周六、周日9:00-16:00（法定节假日除外）'
                    },
                    police: {
                        name: '罗店镇派出所',
                        tel: '021-66860999',
                        address: '罗太路232号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '罗店镇社区卫生服务中心',
                        tel: '021-56011252',
                        address: '罗南镇东太路355号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '大场镇',
                    service: {
                        name: '大场镇社区事务受理中心',
                        tel: '021-61671000',
                        address: '沪太路2518号',
                        time: '冬令时(10月1日-4月30日):周一至周日8:30-11:30 下午13:00-16:30 夏令时(5月1日-9月30日)：周一至周日上午8:30-11:30下午13:30 -17:00（国定假日除外）'
                    },
                    police: {
                        name: '大场镇派出所',
                        tel: '021-66134277',
                        address: '上大路500号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '大场镇社区卫生服务中心',
                        tel: '021-66392331',
                        address: '汶水路1662号(近沪太路)',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '顾村镇',
                    service: {
                        name: '顾村镇社区事务受理中心',
                        tel: '021-66048603',
                        address: '顾村镇电台南路7号',
                        time: '周一至周五 上午8：30-11：00 下午13：00-16：30 夏令时间（6月15日至9月15日）：上午8：30-11：00 下午13：30-16：30 周六周日上午8：30-11：00下午13：00-16：00  （国定假日除外）'
                    },
                    police: {
                        name: '顾村镇派出所',
                        tel: '021-36195184',
                        address: '电台南路2号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '顾村镇社区卫生服务中心',
                        tel: '021-56042147',
                        address: '泰和西路3369号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '罗泾镇',
                    service: {
                        name: '罗泾镇社区事务受理中心',
                        tel: '021-56873707',
                        address: '萧月路7号',
                        time: '周一至周五8.30-16.30  周六、周日8:30-15:00（国定假日除外）'
                    },
                    police: {
                        name: '罗泾镇派出所',
                        tel: '021-56871808',
                        address: '陈川路299号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '罗泾镇社区卫生服务中心',
                        tel: '021-33713957 ',
                        address: '罗泾镇潘沪路128号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '杨行镇',
                    service: {
                        name: '杨行镇社区事务受理中心',
                        tel: '021-56801939',
                        address: '松兰路826号(近宝杨路)',
                        time: '周一至周日上午8:30-11:00 下午13:00-16:30'
                    },
                    police: {
                        name: '杨行镇派出所',
                        tel: '021-56492022',
                        address: '杨泰路198号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '杨行镇社区卫生服务中心',
                        tel: '021-56495839',
                        address: '杨泰路239号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '月浦镇',
                    service: {
                        name: '月浦镇社区事务受理服务中心',
                        tel: '021-36303971',
                        address: '德都路111号',
                        time: '周一至周五8：30-11：00 13：00-16：30'
                    },
                    police: {
                        name: '月浦镇派出所',
                        tel: '021-56646482',
                        address: '月罗路168号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '月浦镇社区卫生服务中心',
                        tel: '021-66681120',
                        address: '月浦龙镇路2号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '淞南镇',
                    service: {
                        name: '淞南镇社区事务受理中心',
                        tel: '021-66186516',
                        address: '长江南路595号',
                        time: '周一至周五8:30-16:30 周六、周日8:30-11:30 13:30-16:30（国定假日除外）'
                    },
                    police: {
                        name: '淞南镇派出所',
                        tel: '021-56149534',
                        address: '淞良路188号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '淞南镇社区卫生服务中心',
                        tel: '021-56466314',
                        address: '淞良路301号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '高境镇',
                    service: {
                        name: '高境镇社区事务受理中心',
                        tel: '021-66793002',
                        address: '河曲路108号',
                        time: '周一至周五8:30-16:30   夏令时周一至周五8:30-17:00 周六、周日上午9:00-11:00下午13:00-16:00（国定假日除外）'
                    },
                    police: {
                        name: '高境镇派出所',
                        tel: '021-66180110',
                        address: '新二路101号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '高境镇社区卫生服务中心',
                        tel: '021-56887746',
                        address: '共康东路55号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }
            ]
        }, {
            district: '浦东新区',
            streets: [
                {
                    name: '潍坊新村街道',
                    service: {
                        name: '潍坊新村街道社区事务受理中心',
                        tel: '021-51029075',
                        address: '浦东新区潍坊路131弄1号',
                        time: '周一至周日 8:30－11:30 13:30-17:00（国定假日除外）'
                    },
                    police: {
                        name: '潍坊新村街道派出所',
                        tel: '021-58305370',
                        address: '崂山路655号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '潍坊新村街道社区卫生服务中心',
                        tel: '021-58204665',
                        address: '崂山路639号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '陆家嘴街道',
                    service: {
                        name: '陆家嘴街道社区事务受理中心',
                        tel: '021-68767121',
                        address: '栖霞路120号',
                        time: '周一至周五8:30-17:00 周六、周日上午8:30-11:30 下午13:30-17:00（国定假日除外）'
                    },
                    police: {
                        name: '陆家嘴街道派出所',
                        tel: '021-58783713',
                        address: '商城路357号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '陆家嘴街道社区卫生服务中心',
                        tel: '021-58303066',
                        address: '乳山路235弄1号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '塘桥街道',
                    service: {
                        name: '塘桥街道社区事务受理中心',
                        tel: '021-50396199',
                        address: '峨山路488号',
                        time: '周一至周日上午8:30-11:30 下午13:30-17:00（国定假日除外）'
                    },
                    police: {
                        name: '塘桥街道派出所',
                        tel: '021-58890406',
                        address: '浦建路99号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '塘桥街道社区卫生服务中心',
                        tel: '021-58397351',
                        address: '浦建路131号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '周家渡街道',
                    service: {
                        name: '周家渡街道社区事务受理中心',
                        tel: '021-50775798',
                        address: '南码头路1136弄35号乙',
                        time: '周一至周日 8:30-17:00(国定节假日除外)'
                    },
                    police: {
                        name: '周家渡街道派出所',
                        tel: '021-58837001',
                        address: '昌里东路185号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '周家渡街道社区卫生服务中心',
                        tel: '021-58839267',
                        address: '昌里东路239号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '东明路街道',
                    service: {
                        name: '东明路街道社区事务受理中心',
                        tel: '021-68303920',
                        address: '上南路4206弄1-3号',
                        time: '周一至周日 上午8:30-11:30 下午13:30-16:30 夏令时接待时间: 上午8:30-11:30 下午14:00-16:30(国定节假日除外)'
                    },
                    police: {
                        name: '东明路街道派出所',
                        tel: '021-22044671',
                        address: '南林路738号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '东明路街道社区卫生服务中心',
                        tel: '021-50633607',
                        address: '环林东路555号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '洋泾街道',
                    service: {
                        name: '洋泾街道社区事务受理中心',
                        tel: '021-38992151',
                        address: '浦东新区巨野路219号',
                        time: '周一至周日 上午8:30-11:30  下午13:30-17:00 (国定节假日除外)'
                    },
                    police: {
                        name: '洋泾街道派出所',
                        tel: '021-58520229',
                        address: '巨野路261号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '洋泾社区卫生服务中心',
                        tel: '021-58524343',
                        address: '巨野路219号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '上钢新村街道',
                    service: {
                        name: '上钢新村街道社区事务受理中心',
                        tel: '021-51923232',
                        address: '昌里路335号(近浦东商场)',
                        time: '周一至周日 8:30-17:00（国定节假日除外）'
                    },
                    police: {
                        name: '上钢新村街道派出所',
                        tel: '021-22046474',
                        address: '历城路50号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '上钢新村街道社区卫生服务中心',
                        tel: '021-58836584',
                        address: '昌里路360号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '沪东新村街道',
                    service: {
                        name: '沪东新村街道社区事务受理中心',
                        tel: '021-58503009',
                        address: '兰城路259号',
                        time: '周一至周日 上午8:20-11:35 下午13:20-17:05（国定假除外）'
                    },
                    police: {
                        name: '沪东新村街道派出所',
                        tel: '021-22047503',
                        address: '兰城路265号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '沪东新村街道社区卫生服务中心',
                        tel: '021-58464269',
                        address: '莱阳路512号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '金杨新村街道',
                    service: {
                        name: '金杨新村街道社区事务受理中心',
                        tel: '021-50370500',
                        address: '银山路330号',
                        time: '周一至周日 上午8:25-11:35 下午13:25-16:35(国定节假日除外)'
                    },
                    police: {
                        name: '金杨新村街道派出所',
                        tel: '021-50758492',
                        address: '云山路1349号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '金杨新村街道社区卫生服务中心',
                        tel: '021-50754611',
                        address: '金杨路121号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '浦兴路街道',
                    service: {
                        name: '浦兴路街道社区事务受理服务中心',
                        tel: '021-50256305',
                        address: '凌河路69号',
                        time: '周一至周五 8:30-11:30 13:30-17:00'
                    },
                    police: {
                        name: '浦兴路街道派出所',
                        tel: '021-68953728',
                        address: '张杨北路588弄90号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '浦兴路街道社区卫生服务中心',
                        tel: '021-68712195',
                        address: '归昌路250号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '南码头路街道',
                    service: {
                        name: '南码头路街道社区事务受理中心',
                        tel: '021-50396125',
                        address: '南码头路400号',
                        time: '周一至周五 上午8:30-11:30 下午13:30-17:00 周六、周日上午 9:00-11:30 下午13:30-16:30（国定节假日除外）'
                    },
                    police: {
                        name: '南码头派出所',
                        tel: '021-22047960',
                        address: '浦三路900号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '南码头路街道社区卫生服务中心',
                        tel: '021-50784028',
                        address: '浦三路696号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '花木街道',
                    service: {
                        name: '花木街道社区事务受理中心',
                        tel: '021-50452710',
                        address: '梅花路291号',
                        time: '周一至周日 上午8:30-11:30 下午13:30-17:00（国定假除外）'
                    },
                    police: {
                        name: '花木街道派出所',
                        tel: '021-68451970',
                        address: '东建路889号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '花木街道社区卫生服务中心',
                        tel: '021-68450808',
                        address: '牡丹路225号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '川沙新镇',
                    service: {
                        name: '川沙新镇社区事务受理中心',
                        tel: '021-68397955',
                        address: '川沙新镇妙境路1336号',
                        time: '周一至周日 上午8:30-11:30 下午13:30-16:30（国定假除外）'
                    },
                    police: {
                        name: '川沙新镇派出所',
                        tel: '021-22046242',
                        address: '平川路333号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '川沙社区卫生服务中心',
                        tel: '021-58924500',
                        address: '绣川路338号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '合庆镇',
                    service: {
                        name: '合庆镇社区事务受理中心',
                        tel: '021-58971201',
                        address: '东川公路7777号1号楼',
                        time: '周一至周日 上午8:30-11:30 下午13:30-16:30（国定假除外）'
                    },
                    police: {
                        name: '合庆镇派出所',
                        tel: '021-58971101',
                        address: '前哨路160号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '合庆镇社区卫生服务中心',
                        tel: '021-58971225',
                        address: '前哨路215号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '曹路镇',
                    service: {
                        name: '曹路镇社区事务受理中心',
                        tel: '021-50688686',
                        address: '龚丰路85号',
                        time: '周一至周日 上午8:30-11:30 下午13:30-16:30（国定假除外）'
                    },
                    police: {
                        name: '顾路镇派出所',
                        tel: '021-58631132',
                        address: '顾曹公路595号（晶钻路855号）',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '曹路镇社区卫生服务中心',
                        tel: '021-58562502',
                        address: '曹路镇龚新路470号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '高东镇',
                    service: {
                        name: '高东镇社区事务受理中心',
                        tel: '021-58486215',
                        address: '高东光明路433号',
                        time: '周一至周日 8:30-16:30(国定节假日除外)'
                    },
                    police: {
                        name: '高东镇派出所',
                        tel: '021-58480209',
                        address: '光明路728号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '高东镇社区卫生服务中心',
                        tel: '021-68487691',
                        address: '北新园路459号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '高桥镇',
                    service: {
                        name: '高桥镇社区事务受理中心',
                        tel: '021-50581766',
                        address: '张杨北路5168号',
                        time: '周一至周日 8:30-16:30(国定节假日除外)'
                    },
                    police: {
                        name: '高桥镇派出所',
                        tel: '021-58671010',
                        address: '草高支路666号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '高桥镇社区卫生服务中心',
                        tel: '021-58672539',
                        address: '欧高路128号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '高行镇',
                    service: {
                        name: '高行镇社区事务受理中心',
                        tel: '021-68974238',
                        address: '新行路340号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 (国定节假日除外）'
                    },
                    police: {
                        name: '高行镇派出所',
                        tel: '021-68979768',
                        address: '新行路330号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '高行镇社区卫生服务中心',
                        tel: '021-58651396',
                        address: '金高路180号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '金桥镇',
                    service: {
                        name: '金桥镇社区事务受理中心',
                        tel: '021-58995295',
                        address: '佳林路585号3号楼',
                        time: '周一至周日 8:30-16:30（节日除外）'
                    },
                    police: {
                        name: '金桥镇派出所',
                        tel: '021-58992505',
                        address: '永宁路124号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '金桥镇社区卫生服务中心',
                        tel: '021-58992510',
                        address: '佳林路1028号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '张江镇',
                    service: {
                        name: '张江镇社区事务受理中心',
                        tel: '021-50793310',
                        address: '张江镇张江路1458号',
                        time: '周一至周日 上午8:30-11:30 下午13:30-16:30（国定节假日除外）'
                    },
                    police: {
                        name: '',
                        tel: '',
                        address: '',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '张江镇社区卫生服务中心',
                        tel: '021-33924210',
                        address: '益江路458号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '唐镇',
                    service: {
                        name: '唐镇社区事务受理中心',
                        tel: '021-68381116',
                        address: '唐镇唐兴路495号',
                        time: '周一至周日 上午8:30-11:30 下午13:30-16:30（国定节假日除外）'
                    },
                    police: {
                        name: '唐镇派出所',
                        tel: '021-58961106',
                        address: '创兴中路99号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '唐镇社区卫生服务中心',
                        tel: '021-58961101',
                        address: '创新中路75号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '北蔡镇',
                    service: {
                        name: '北蔡镇社区事务受理中心',
                        tel: '021-68926111',
                        address: '沪南路1105号',
                        time: '周一至周五 8:30-17:00（国定节假日除外）'
                    },
                    police: {
                        name: '北蔡镇派出所',
                        tel: '021-58911514',
                        address: '莲园路225-1号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '北蔡镇社区卫生服务中心',
                        tel: '021-68943352',
                        address: '莲园路271号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '三林镇',
                    service: {
                        name: '三林镇社区事务受理中心',
                        tel: '021-50823008',
                        address: '长清路2188号',
                        time: '周一至周日 上午8:30-11:30 下午13:00-16:30 周一至周五8:30-11:30 下午13:00-16:30 （国定节假日除外）'
                    },
                    police: {
                        name: '三林镇派出所',
                        tel: '021-50841100',
                        address: '三林路111号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '三林镇社区卫生服务中心',
                        tel: '021-58410311',
                        address: '三林路375号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '申港街道',
                    service: {
                        name: '申港街道社区事务受理中心',
                        tel: '021-38072001',
                        address: '临港新城环湖西一路99号主',
                        time: '周一至周五 8:30-11:30  13:00-17:00（国定节假日除外） '
                    },
                    police: {
                        name: '',
                        tel: '',
                        address: '',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '泥城镇社区卫生服务中心',
                        tel: '021-58072941',
                        address: '泥城镇南芦公路1843号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '惠南镇',
                    service: {
                        name: '惠南镇社区事务受理中心街道',
                        tel: '021-68090232',
                        address: '人民西路555号',
                        time: '周一至周五8:30-11:30 13:00-16:30（国定节假日除外）'
                    },
                    police: {
                        name: '惠南镇派出所',
                        tel: '021-58021226',
                        address: '南祝路3990号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '惠南镇社区卫生服务中心',
                        tel: '021-68272119',
                        address: '观海路259号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '新场镇',
                    service: {
                        name: '新场镇社区事务受理中心',
                        tel: '021-58171717',
                        address: '新场镇新奉公路331号',
                        time: '周一至周五 上午8:30-11:00 下午13:00-16:30 周六、周日上午8:30-11:00 下午13:00-16:00（国定假日除外）'
                    },
                    police: {
                        name: '新场镇派出所',
                        tel: '021-58172129',
                        address: '新场镇石笋街8号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '新场镇社区卫生服务中心',
                        tel: '021-68170995',
                        address: '新场镇牌楼西路58号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '大团镇',
                    service: {
                        name: '大团镇社区事务受理中心',
                        tel: '021-58081037',
                        address: '大团镇永春东路10号',
                        time: '周一至周五 上午8:30-11:00 下午13:00-16:30 周六、周日上午8:30-11:00 下午13:00-16:00（国定假日除外）'
                    },
                    police: {
                        name: '大团镇派出所',
                        tel: '021-58081075',
                        address: '永旺路288号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '大团镇社区卫生服务中心',
                        tel: '021-58082059',
                        address: '永定南路169号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '周浦镇',
                    service: {
                        name: '周浦镇社区事务受理中心',
                        tel: '021-20922225',
                        address: '祝家港路190号',
                        time: '周一至周五 上午8:30-11：00 下午13：00-16:30 周六、周日上午8:30-11:00 下午13:00-16:00（国定假日除外）'
                    },
                    police: {
                        name: '周浦镇派出所',
                        tel: '021-58111030',
                        address: '周东南路33号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '周浦镇社区卫生服务中心',
                        tel: '021-33890995',
                        address: '沈梅东路163号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '航头镇',
                    service: {
                        name: '航头镇社区事务受理中心',
                        tel: '021-58229649',
                        address: '航头镇航头路188号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    },
                    police: {
                        name: '航头镇派出所',
                        tel: '021-58222129',
                        address: '行政路16号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '航头镇社区卫生服务中心',
                        tel: '021-58228567',
                        address: '沪南公路5395号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '芦潮港镇',
                    service: {
                        name: '芦潮港镇社区事务受理中心',
                        tel: '021-20942117',
                        address: '芦潮港镇芦硕路298号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    },
                    police: {
                        name: '芦潮港镇派出所',
                        tel: '021-58281616',
                        address: '芦潮港镇芦潮路95号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '芦潮港镇社区卫生服务中心',
                        tel: '021-58281594',
                        address: '芦潮港镇果园路145弄48号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '康桥镇',
                    service: {
                        name: '康桥镇社区事务受理中心',
                        tel: '021-58121340',
                        address: '沪南路2538号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    },
                    police: {
                        name: '康桥镇派出所',
                        tel: '021-20904110',
                        address: '秀浦路1166号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '康桥镇社区卫生服务中心',
                        tel: '021-20911565',
                        address: '康弘路565号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '宣桥镇',
                    service: {
                        name: '宣桥镇社区事务受理中心',
                        tel: '021-58186291',
                        address: '宣桥镇六奉公路128号',
                        time: '周一至周日 上午8:30-11:20 下午13:30-16:30'
                    },
                    police: {
                        name: '宣桥镇派出所',
                        tel: '021-58036329',
                        address: '下盐路3688路',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '宣桥镇社区卫生服务中心',
                        tel: '021-58189195',
                        address: '沪南公路8719',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '六灶镇',
                    service: {
                        name: '六灶街道社区事务受理服务中心',
                        tel: '021-58162546',
                        address: '周祝公路2378号',
                        time: '周一至周五 上午 8:30-11:30 下午 12:30－16:30 （国定假日除外）'
                    },
                    police: {
                        name: '六灶镇派出所',
                        tel: '021-58162621',
                        address: '吉灿路20弄1号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '六灶街道社区卫生服务中心',
                        tel: '021-58162674',
                        address: '崇溪路120号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '祝桥镇',
                    service: {
                        name: '祝桥镇社区事务受理中心',
                        tel: '021-58108833',
                        address: '祝桥镇南祝公路5058号',
                        time: '周一至周日 8:30-16:30（国定节假日除外）'
                    },
                    police: {
                        name: '祝桥镇派出所',
                        tel: '021-58107021',
                        address: '百熙路39号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '祝桥镇社区卫生服务中心',
                        tel: '021-58102150',
                        address: '南奉公路5009号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '泥城镇',
                    service: {
                        name: '泥城镇社区事务受理中心',
                        tel: '021-58071212',
                        address: '鸿音路3152号',
                        time: '周一至周日 8:30-16:30（国定节假日除外）'
                    },
                    police: {
                        name: '泥城镇派出所',
                        tel: '021-58071047',
                        address: '鸿音路3138弄6号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '泥城镇社区卫生服务中心',
                        tel: '021-58072941',
                        address: '泥城镇南芦公路1843号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '书院镇',
                    service: {
                        name: '书院镇社区事务受理中心',
                        tel: '021-58198707',
                        address: '书院镇新卫路8号',
                        time: '周一至周五8:30—16:30 周六周日8:30-16:00（国定节假日除外）'
                    },
                    police: {
                        name: '书院镇派出所',
                        tel: '021-58190850 ',
                        address: '新府路75号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '书院镇社区卫生服务中心',
                        tel: '021-58196995',
                        address: '新卫路6号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '万祥镇',
                    service: {
                        name: '万祥镇社区事务受理中心',
                        tel: '021-58042117',
                        address: '万祥镇万和路188号',
                        time: '周一至周五：8:00-16:30；周六、周日：8:30-16:00（国定节假日除外）'
                    },
                    police: {
                        name: '万祥镇派出所',
                        tel: '021-58046411',
                        address: '万祥镇茂盛路170号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '万祥社区卫生服务中心',
                        tel: '021-58042117',
                        address: '万祥镇万和路185号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '老港镇',
                    service: {
                        name: '老港镇社区事务受理中心',
                        tel: '021-58051106',
                        address: '老港镇建中路556号',
                        time: '周一至周五 上午8:30-11:30 下午13:00-16:30 周六、周日上午8:30-11:00 下午13:30-16:00（国定节假日除外）'
                    },
                    police: {
                        name: '老港镇派出所',
                        tel: '021-58051829',
                        address: '建中路110号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '老港镇社区卫生服务中心',
                        tel: '021-68291349',
                        address: '老港镇鑫盛路13号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }
            ]
        }, {
            district: '闵行区',
            streets: [
                {
                    name: '江川路街道',
                    service: {
                        name: '江川街道社区事务受理服务中心',
                        tel: '021-64622694',
                        address: '鹤庆路398号',
                        time: '周一至周五 8:30-11:30 13:30-16:30（国定节假日除外）'
                    },
                    police: {
                        name: '碧江路街道派出所',
                        tel: '021-64306176',
                        address: '兰坪路352弄1号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '江川街道社区卫生服务中心',
                        tel: '021-64356116',
                        address: '闵行区沪闵路63号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '龙柏街道',
                    service: {
                        name: '龙柏街道社区事务受理服务中心',
                        tel: '021-64215151',
                        address: '航东路355号',
                        time: '周一至周五 8:30-11:30 13:30-16:30（国定节假日除外）'
                    },
                    police: {
                        name: '龙柏街道派出所',
                        tel: '021-64029712',
                        address: '兰竹路2号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '龙柏社区卫生服务中心',
                        tel: '021-64205388',
                        address: '航东路608号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '古美街道',
                    service: {
                        name: '古美街道社区事务受理中心',
                        tel: '021-54163600',
                        address: '古龙路1139号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    },
                    police: {
                        name: '古美街道派出所',
                        tel: '021-54937110',
                        address: '顾戴路386号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '古美街道社区卫生服务中心',
                        tel: '021-54165659',
                        address: '龙茗路668号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '莘庄镇',
                    service: {
                        name: '莘庄镇社区事务受理中心',
                        tel: '021-54163600',
                        address: '莘西南路158号1号楼',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    },
                    police: {
                        name: '莘庄镇派出所',
                        tel: '021-54530608',
                        address: '七莘路789号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '莘庄镇社区卫生服务中心',
                        tel: '021-64133106',
                        address: '水清路1099号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '七宝镇',
                    service: {
                        name: '七宝镇社区事务受理中心',
                        tel: '021-54791001',
                        address: '沪松公路577号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    },
                    police: {
                        name: '七宝镇派出所',
                        tel: '021-33501110',
                        address: '沪松公路600号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '七宝镇社区卫生服务中心',
                        tel: '021-64781051',
                        address: '富强街94号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '浦江镇',
                    service: {
                        name: '浦江镇社区事务受理中心',
                        tel: '021-34302140',
                        address: '浦瑞路326号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    },
                    police: {
                        name: '浦江镇派出所',
                        tel: '021-54840110',
                        address: '闸航路2688号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '浦江镇社区卫生服务中心',
                        tel: '021-64110433',
                        address: '江文路681号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '梅陇镇',
                    service: {
                        name: '梅陇镇社区事务受理中心',
                        tel: '021-64101122',
                        address: '莘朱路1925号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    },
                    police: {
                        name: '梅陇镇派出所',
                        tel: '021-54396600',
                        address: '罗阳路333号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '梅陇镇社区卫生服务中心',
                        tel: '021-54287048',
                        address: '景彩路100号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '虹桥镇',
                    service: {
                        name: '虹桥镇社区事务受理中心',
                        tel: '021-64658822',
                        address: '合川路2885号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    },
                    police: {
                        name: '虹桥镇派出所',
                        tel: '021-64061006',
                        address: '吴中路1859号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '虹桥镇社区卫生服务中心',
                        tel: '021-64060016',
                        address: '虹桥镇吴中路829号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '马桥镇',
                    service: {
                        name: '马桥镇社区事务受理中心',
                        tel: '021-64099686',
                        address: '马桥镇银春路2016号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    },
                    police: {
                        name: '马桥镇派出所',
                        tel: '021-64090262',
                        address: '元松路1号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '马桥镇社区卫生服务中心',
                        tel: '021-64096354',
                        address: '马桥镇富砾路188号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '吴泾镇',
                    service: {
                        name: '吴泾镇社区事务受理中心',
                        tel: '021-54737105',
                        address: '龙吴路5530弄40号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    },
                    police: {
                        name: '塘湾派出所',
                        tel: '021-34305621',
                        address: '三新街78号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '吴泾社区卫生服务中心',
                        tel: '021-34305966',
                        address: '永德路790号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '华漕镇',
                    service: {
                        name: '华漕镇社区事务受理中心',
                        tel: '021-33509620',
                        address: '平乐路25号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    },
                    police: {
                        name: '华漕派出所',
                        tel: '021-33509620',
                        address: '诸新路58号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '华漕镇社区卫生服务中心',
                        tel: '021-62211540',
                        address: '华漕镇纪翟路保乐路2号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '颛桥镇',
                    service: {
                        name: '颛桥镇社区事务受理中心',
                        tel: '021-51987090',
                        address: '联农路297号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    },
                    police: {
                        name: '颛桥镇派出所',
                        tel: '021-34074123',
                        address: '中沟路99号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '颛桥镇社区卫生服务中心',
                        tel: '021-64890026',
                        address: '颛兴路122号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '莘庄工业区街道',
                    service: {
                        name: '莘庄工业区社区事务受理服务中心',
                        tel: '021-34909876',
                        address: '春光路710号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    },
                    police: {
                        name: '闵行开发区治安派出所',
                        tel: '021-64636621',
                        address: '中和路119号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '莘庄工业区社区卫生服务中心',
                        tel: '021-34909876',
                        address: '春光路710号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '新虹街道',
                    service: {
                        name: '新虹街道社区事务受理服务中心',
                        tel: '021-52962133',
                        address: '申滨路777号1楼',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    },
                    police: {
                        name: '',
                        tel: '',
                        address: '',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '新虹社区卫生服务中心',
                        tel: '021-54339992',
                        address: '申滨路618号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }
            ]
        }, {
            district: '奉贤区',
            streets: [
                {
                    name: '南桥镇',
                    service: {
                        name: '南桥镇社区事务受理中心',
                        tel: '021-67194346',
                        address: '环城西路477号',
                        time: '周一至周五 8:30-16:30(夏天17:00) 周六、周日8:30-11:00 13:00-16:00'
                    },
                    police: {
                        name: '南桥镇派出所',
                        tel: '021-67190165',
                        address: '南中路480号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '南桥镇社区卫生服务中心',
                        tel: '021-33611780',
                        address: '南桥镇南中路260号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '庄行镇',
                    service: {
                        name: '庄行镇社区事务受理中心',
                        tel: '021-57469107',
                        address: '庄行镇新苑路2号',
                        time: '周一至周日上午8:30-11:00 下午13:30-16:30(法定节假日除外)'
                    },
                    police: {
                        name: '庄行镇派出所',
                        tel: '021-57466128',
                        address: '一新路37号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '庄行镇社区卫生服务中心',
                        tel: '021-57466335',
                        address: '南亭公路3073号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '金汇镇',
                    service: {
                        name: '金汇镇社区事务受理中心',
                        tel: '021-57481183',
                        address: '金汇镇金碧路2028号大尧路南',
                        time: '周一至周日 8:30-16:30'
                    },
                    police: {
                        name: '金汇镇派出所',
                        tel: '021-57481130',
                        address: '金闸公路111号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '金汇镇社区卫生服务中心',
                        tel: '021-57481259',
                        address: '金汇镇金钱公路755号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '柘林镇',
                    service: {
                        name: '柘林镇社区事务受理中心',
                        tel: '021-57446187',
                        address: '柘林镇钦林北路56号',
                        time: '周一至周日8:30-11:00 13:00-16:30(法定国假日除外)'
                    },
                    police: {
                        name: '柘林镇派出所',
                        tel: '021-57446124',
                        address: '新柘中路28号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '柘林镇社区卫生服务中心',
                        tel: '021-57446205',
                        address: '柘林镇钦林北路70号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '青村镇',
                    service: {
                        name: '青村镇社区事务受理中心',
                        tel: '021-57562097',
                        address: '青村镇南奉公路2729号',
                        time: '周一至周日上午8：30—11：30 下午13：00—16：30（除法定节假日）'
                    },
                    police: {
                        name: '青村镇派出所',
                        tel: '021-57561050',
                        address: '青村城乡路6号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '青村镇社区卫生服务中心',
                        tel: '021-57561252',
                        address: '青村镇青村南路182号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '奉城镇',
                    service: {
                        name: '奉城镇社区事务受理中心',
                        tel: '021-57520547',
                        address: '兰博路2009号',
                        time: '周一至周五 上午8：30-11：30 下午13：00-17：00 周六、周日 上午9：00-11：00 下午13：00-15：30 （国定节假日除外）'
                    },
                    police: {
                        name: '奉城镇派出所',
                        tel: '021-57522051',
                        address: '城协路1366号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '奉城镇社区卫生服务中心',
                        tel: '021-57131831',
                        address: '奉城镇洪庙洪运路11号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '四团镇',
                    service: {
                        name: '四团镇社区事务受理中心',
                        tel: '021-57533152',
                        address: '四团镇天鹏街54弄32-35号',
                        time: '周一至周五 8：30-16：30 周六、周日上午8：30-11：00，下午13：30-16：00 （国定节假日除外）'
                    },
                    police: {
                        name: '四团镇派出所',
                        tel: '021-57533530',
                        address: '南奉公路8042号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '四团镇社区卫生服务中心',
                        tel: '021-57533457',
                        address: '天鹏路48号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '海湾镇',
                    service: {
                        name: '海湾镇社区事务受理中心',
                        tel: '021-57504779',
                        address: '星火农场海农公路1478号',
                        time: '周一至周五 上午8：30-11:30，下午2:00-5:00（国定节假日除外）'
                    },
                    police: {
                        name: '海湾镇派出所',
                        tel: '021-57127110',
                        address: '海湾旅游区奉炮公路316号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '海湾镇社区卫生服务中心',
                        tel: '021-57501487',
                        address: '海湾镇海农公路1438号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }
            ]
        }, {
            district: '青浦区',
            streets: [
                {
                    name: '夏阳街道',
                    service: {
                        name: '夏阳街道社区事务受理中心',
                        tel: '021-59731779',
                        address: '青浦区城中南路58号',
                        time: '周一至周日上午8:30-11:30 下午14:00-17:00（法定节假日除外）'
                    },
                    police: {
                        name: '夏阳街道派出所',
                        tel: '021-59729876',
                        address: '华青路399号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '夏阳街道社区卫生服务中心',
                        tel: '021-57814383',
                        address: '华科路85号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '盈浦街道',
                    service: {
                        name: '盈浦街道社区事务受理中心',
                        tel: '021-69223601',
                        address: '青浦区胜利路119号',
                        time: '周一至周日上午8:30—11:15 下午14:00—17:00(法定节假日除外）'
                    },
                    police: {
                        name: '盈浦街道派出所',
                        tel: '021-69223680',
                        address: '胜利路111号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '盈浦街道社区服务中心',
                        tel: '021-59203180',
                        address: '盈福路50号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '香花桥街道',
                    service: {
                        name: '香花桥街道社区事务受理中心',
                        tel: '021-59221919',
                        address: '青浦区香大路1001号',
                        time: '周一至周日上午8:30-11:30 下午13:30-16:30（法定节假日除外）'
                    },
                    police: {
                        name: '香花桥街道派出所',
                        tel: '021-59221258',
                        address: '新胜路6号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '香花桥街道社区卫生服务中心',
                        tel: '021-59220214',
                        address: '青浦新桥路1195弄1号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '赵巷镇',
                    service: {
                        name: '赵巷镇社区事务受理中心',
                        tel: '021-59750070',
                        address: '青浦区赵巷镇镇中路580号',
                        time: '周一至周日上午8:30—11:30 下午13:00—16:30（法定节假日除外）'
                    },
                    police: {
                        name: '赵巷镇派出所',
                        tel: '021-59754110',
                        address: '镇中路528号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '赵巷镇社区服务中心',
                        tel: '021-59754995',
                        address: '巷区路289号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '徐泾镇',
                    service: {
                        name: '徐泾镇社区事务受理中心',
                        tel: '021-59760342',
                        address: '徐泾镇明珠路800号',
                        time: '周一至周日上午8:30—11:00 下午13:00—16:30(法定节假日除外）'
                    },
                    police: {
                        name: '徐泾镇派出所',
                        tel: '021-69761101',
                        address: '京华路380号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '徐泾镇社区服务中心',
                        tel: '021-59760031',
                        address: '徐民路1088号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '华新镇',
                    service: {
                        name: '华新镇社区事务受理中心',
                        tel: '021-59797741',
                        address: '华新镇华强街585号',
                        time: '周一至周日上午8:30-11:30 下午13:30-16:30(法定节假日除外）'
                    },
                    police: {
                        name: '华新镇派出所',
                        tel: '021-59791074',
                        address: '华新街296号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '华新镇社区服务中心',
                        tel: '021-59791740',
                        address: '华志路800号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '重固镇',
                    service: {
                        name: '重固镇社区事务受理中心',
                        tel: '021-59786333',
                        address: '赵重公路3025号',
                        time: '周一至周日上午8:30-11:30 下午13:30-16:30(法定节假日除外）'
                    },
                    police: {
                        name: '重固镇派出所',
                        tel: '021-59781249',
                        address: '重固大街988号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '重固镇社区卫生服务中心',
                        tel: '021-59784599',
                        address: '连茂路68号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '白鹤镇',
                    service: {
                        name: '白鹤镇社区事务受理中心',
                        tel: '021-59212666',
                        address: '赵屯建屯路130号5号楼',
                        time: '周一至周日上午8:30-11:30 下午13:30-16:30（法定节假日除外）'
                    },
                    police: {
                        name: '白鹤镇派出所',
                        tel: '021-59744040',
                        address: '纪鹤公路6600号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '白鹤镇社区卫生服务中心',
                        tel: '021-59740132',
                        address: '外青松公路2961号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '朱家角镇',
                    service: {
                        name: '朱家角镇社区事务受理中心',
                        tel: '021-59247703',
                        address: '沙家埭路18号',
                        time: '周一至周日上午8:30—11:30 下午13:00—16:30（法定节假日除外）'
                    },
                    police: {
                        name: '朱家角镇派出所',
                        tel: '021-59242774',
                        address: '漕平路35号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '朱家角镇社区卫生服务中心',
                        tel: '021-59831215',
                        address: '朱家角镇曲池路39号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '练塘镇',
                    service: {
                        name: '练塘镇社区事务受理中心',
                        tel: '021-59255965',
                        address: '练塘镇章练塘路900号',
                        time: '周一至周日8:30—16:00 (法定节假日除外)'
                    },
                    police: {
                        name: '练塘镇派出所',
                        tel: '021-59252320',
                        address: '练塘镇朱枫公路3555号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '练塘镇社区卫生服务中心',
                        tel: '021-59255086',
                        address: '练塘镇朱枫公路3619号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '金泽镇',
                    service: {
                        name: '金泽镇社区事务受理中心',
                        tel: '021-59261029',
                        address: '金中路19号',
                        time: '周一至周日上午8:30-11:00 下午13:30-16:30法定节假日除外)'
                    },
                    police: {
                        name: '金泽镇派出所',
                        tel: '021-59261312',
                        address: '培爱路85号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '金泽镇社区卫生服务中心',
                        tel: '021-59261980',
                        address: '培育路271号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }
            ]
        }, {
            district: '松江区',
            streets: [
                {
                    name: '岳阳街道',
                    service: {
                        name: '岳阳街道社区事务受理中心',
                        tel: '021-57716655',
                        address: '松江区人民北路73弄-1号',
                        time: '周一至周五上午8:30-11:30 下午13:00-16:30,周六、周日上午9:00-11:30 下午13:00-16:00（法定节假日除外）'
                    },
                    police: {
                        name: '岳阳街道派出所',
                        tel: '021-57818110',
                        address: '谷阳北路44号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '岳阳街道社区卫生服务中心',
                        tel: '021-57814383',
                        address: '松江区阔街21号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '中山街道',
                    service: {
                        name: '中山街道社区事务受理中心',
                        tel: '021-67743115',
                        address: '松江区茸梅路139号',
                        time: '周一至周五 上午8：30-11：30 下午13：00-17：00 周六、周日 上午9：00-11：00 下午13：00-15：30 （国定节假日除外）'
                    },
                    police: {
                        name: '中山街道派出所',
                        tel: '021-57780852',
                        address: '绒梅路2号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '中山街道社区卫生服务中心',
                        tel: '021-57786088',
                        address: '茸梅路沪松路口西侧',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '永丰街道',
                    service: {
                        name: '永丰街道社区事务受理中心',
                        tel: '021-67816119',
                        address: '仓华路623-625号',
                        time: '周一至周五8:30-16:30 周六、周日上午9:00-11:00 下午13:00-15:30,（国定假日休息）'
                    },
                    police: {
                        name: '永丰街道派出所',
                        tel: '021-67710853',
                        address: '荣乐西路126号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '永丰街道社区卫生服务中心',
                        tel: '021-57825909',
                        address: '仓华路623-625号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '方松街道',
                    service: {
                        name: '方松街道社区事务受理中心',
                        tel: '021-37021526',
                        address: '松江区文涵路733号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—10：30，下午13：00—15：00（法定节假日除外）'
                    },
                    police: {
                        name: '方松街道派出所',
                        tel: '021-67718984',
                        address: '龙马路55号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '方松街道社区卫生服务中心',
                        tel: '021-67736999',
                        address: '文诚路805号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '九亭镇',
                    service: {
                        name: '九亭镇社区事务受理中心',
                        tel: '021-57635300',
                        address: '松江区九新公路219号2楼',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00 下午13：00—15：00（法定节假日除外）'
                    },
                    police: {
                        name: '九亭镇派出所',
                        tel: '021-57631904',
                        address: '易富路200号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '九亭镇社区卫生服务中心',
                        tel: '021-57631289',
                        address: '易富路128号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '泗泾镇',
                    service: {
                        name: '泗泾镇社区事务受理中心',
                        tel: '021-57863486',
                        address: '泗泾镇文化路298号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00，下午13：00—15：00（法定节假日除外）'
                    },
                    police: {
                        name: '泗泾镇派出所',
                        tel: '021-57610739',
                        address: '泗陈公路333弄110号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '泗泾镇社区卫生服务中心',
                        tel: '021-57610154',
                        address: '泗泾镇江川北路108号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '泖港镇',
                    service: {
                        name: '泖港镇社区事务受理中心',
                        tel: '021-57863486',
                        address: '松江区泖港镇中南路35号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00 下午13：00—15：00（法定节假日除外）'
                    },
                    police: {
                        name: '泖港镇派出所',
                        tel: '021-57861420',
                        address: '新宾路426号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '泖港镇社区卫生服务中心',
                        tel: '021-57861523',
                        address: '泖港镇新宾路436号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '车墩镇',
                    service: {
                        name: '车墩镇社区事务受理中心',
                        tel: '021-67654573',
                        address: '车墩镇影视路28弄1号楼',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00，下午13：00—15：30（法定节假日除外）'
                    },
                    police: {
                        name: '车墩镇派出所',
                        tel: '021-57601094',
                        address: '车香路15号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '车墩镇社区卫生服务中心',
                        tel: '021-57605950',
                        address: '虬长路168号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '洞泾镇',
                    service: {
                        name: '洞泾镇社区事务受理中心',
                        tel: '021-57672532',
                        address: '松江区洞泾镇长兴路622号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00 下午13：00—15：30（法定节假日除外）'
                    },
                    police: {
                        name: '洞泾镇派出所',
                        tel: '021-57672728',
                        address: '张泾路110号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '洞泾镇社区卫生服务中心',
                        tel: '021-57699900',
                        address: '洞泾镇长兴东路1566号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '叶榭镇',
                    service: {
                        name: '叶榭镇社区事务受理中心',
                        tel: '021-57805798',
                        address: '叶榭镇强恕路138-158号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00，下午13：00—15：30（法定节假日除外）'
                    },
                    police: {
                        name: '叶榭镇派出所',
                        tel: '021-57805959',
                        address: '叶榭镇政府路399号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '叶榭镇社区卫生服务中心',
                        tel: '021-57803955',
                        address: '叶权路210号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '新桥镇',
                    service: {
                        name: '新桥镇社区事务受理中心',
                        tel: '021-57642626',
                        address: '新桥镇新站路460号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00，下午13：00—15：30（法定节假日除外）'
                    },
                    police: {
                        name: '新桥镇派出所',
                        tel: '021-57643220',
                        address: '新镇街133号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '新桥镇社区卫生服务中心',
                        tel: '021-57647646',
                        address: '新南街268号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '石湖荡镇',
                    service: {
                        name: '石湖荡镇社区事务受理中心',
                        tel: '021-57753525',
                        address: '石湖荡镇学府路160号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00 下午13：00—15：30（法定节假日除外）'
                    },
                    police: {
                        name: '石湖荡镇派出所',
                        tel: '021-57841993',
                        address: '育新路589号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '石湖荡镇社区卫生服务中心',
                        tel: '021-57752141',
                        address: '石湖新路105号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '新浜镇',
                    service: {
                        name: '新浜镇社区事务受理中心',
                        tel: '021—57892224',
                        address: '新浜镇新绿街398号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00，下午13：00—15：30（法定节假日除外）'
                    },
                    police: {
                        name: '新浜镇派出所',
                        tel: '021—57892224',
                        address: '新浜镇新绿街398号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '新浜镇社区卫生服务中心',
                        tel: '021-57891760',
                        address: '新浜镇共青路1231号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '佘山镇',
                    service: {
                        name: '佘山镇社区事务受理中心',
                        tel: '021-57659776',
                        address: '佘山镇佘新路358号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00，下午13：00—15：30（法定节假日除外）'
                    },
                    police: {
                        name: '佘山镇派出所',
                        tel: '021-57651310',
                        address: '佘新路298号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '佘山镇社区卫生服务中心',
                        tel: '021-57659200',
                        address: '陈坊桥佘新路18号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '小昆山镇',
                    service: {
                        name: '小昆山镇社区事务受理服务中心',
                        tel: '021-57761030',
                        address: '鹤溪街57号',
                        time: '周一至周五上午8:30-11:15下午13:30-16:30，周六、周日上午9:00-11:00下午13:30-15:30（法定节假日除外）'
                    },
                    police: {
                        name: '',
                        tel: '',
                        address: '',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '小昆山镇社区卫生服务中心',
                        tel: '021-57762672',
                        address: '小昆山镇文翔路6300号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }
            ]
        }, {
            district: '嘉定区',
            streets: [
                {
                    name: '嘉定镇街道',
                    service: {
                        name: '嘉定镇街道社区事务受理中心',
                        tel: '021-59928106',
                        address: '塔城路360弄8号',
                        time: '周一至周五8：30－17：00 周六至周日8：30-16：00（法定节假日除外）'
                    },
                    police: {
                        name: '嘉定镇街道派出所',
                        tel: '021-59509585',
                        address: '嘉松北路4418号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '嘉定镇街道社区卫生服务中心',
                        tel: '021-69530665',
                        address: '北大街128号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '新成路街道',
                    service: {
                        name: '新成路街道社区事务受理中心',
                        tel: '021-59986381',
                        address: '新成路155号',
                        time: '周一至周五8:30-17:00 周六至周日8:30-16:00（法定节假日除外）'
                    },
                    police: {
                        name: '新成路街道派出所',
                        tel: '021-59995180',
                        address: '迎园路888号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '新成路街道社区卫生服务中心',
                        tel: '021-59995539',
                        address: '墅沟路400号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '真新新村街道',
                    service: {
                        name: '真新新村街道社区事务受理中心',
                        tel: '021-59197632',
                        address: '清峪路985号',
                        time: '周一至周五8：30-17：00 周六至周日9：00-16：00（法定节假日除外）'
                    },
                    police: {
                        name: '真新新村街道派出所',
                        tel: '021-69195110',
                        address: '清峪路999号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '真新新村街道社区卫生服务中心',
                        tel: '021-59195439',
                        address: '丰庄路255号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '马陆镇',
                    service: {
                        name: '马陆镇社区事务受理中心',
                        tel: '021-59153113',
                        address: '沪宜公路2228号',
                        time: '周一至周五8：30－17：00 周六至周日8：30-16：00（法定节假日除外）'
                    },
                    police: {
                        name: '马陆镇派出所',
                        tel: '021-59156585',
                        address: '沪宜公路1888号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '马陆镇社区卫生服务中心',
                        tel: '021-59156106',
                        address: '嘉定区沪宜公路2091号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '南翔镇',
                    service: {
                        name: '南翔镇社区事务受理中心',
                        tel: '021-59126004',
                        address: '古漪园路358号',
                        time: '周一至周五上午8：00－11：00 下午13：00－17：00周六至周日上午8：00－11：00；下午13：00－17：00（法定节假日除外）'
                    },
                    police: {
                        name: '南翔镇派出所',
                        tel: '021-59121088',
                        address: '众仁路555号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '南翔镇社区卫生服务中心',
                        tel: '021-59179833',
                        address: '南翔镇民主街97号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '江桥镇',
                    service: {
                        name: '江桥镇社区事务受理中心',
                        tel: '021-69001302',
                        address: '华江支路129号5号楼',
                        time: '周一至周五8:30-17:00  周六至周日8:30-16:00（法定节假日除外）'
                    },
                    police: {
                        name: '江桥镇派出所',
                        tel: '021-59144585',
                        address: '金沙江西路2131号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '江桥镇社区卫生服务中心',
                        tel: '021-69929900',
                        address: '江桥镇金耀路100号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '黄渡镇',
                    service: {
                        name: '黄渡镇社区事务受理服务中心',
                        tel: '021-69580303',
                        address: '绿苑路39号',
                        time: '周一至周五8:30-17:00  周六至周日8:30-16:00（法定节假日除外）'
                    },
                    police: {
                        name: '黄渡镇派出所',
                        tel: '021-59595214',
                        address: '嘉松北路7285号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '黄渡镇社区卫生服务中心',
                        tel: '021-59595271',
                        address: '新黄路10号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '安亭镇',
                    service: {
                        name: '安亭镇社区事务受理中心',
                        tel: '021-69578880',
                        address: '民丰路988号',
                        time: '周一至周五8:30—17:00 周六至周日8:30—16:00（法定节假日除外）'
                    },
                    police: {
                        name: '安亭镇派出所',
                        tel: '021-39503800',
                        address: '墨玉路221号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '安亭镇社区卫生服务中心',
                        tel: '021-39107725',
                        address: '安亭镇民丰路1200号 ',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '外冈镇',
                    service: {
                        name: '外冈镇社区事务受理中心',
                        tel: '021-39106683',
                        address: '瞿门路518号',
                        time: '周一至周五8:30-17:00  周六至周日8:30-16:00（法定节假日除外）'
                    },
                    police: {
                        name: '外冈镇派出所',
                        tel: '021-59588808',
                        address: '外青松公路135号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '外冈镇社区卫生服务中心',
                        tel: '021-59588626',
                        address: '外冈镇祁昌路355号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '徐行镇',
                    service: {
                        name: '徐行镇社区事务受理中心',
                        tel: '021-59559801',
                        address: '新建一路1568号',
                        time: '周一至周五8:30-17:00  周六至周日8:30-16:00（法定节假日除外）'
                    },
                    police: {
                        name: '徐行镇派出所',
                        tel: '021-59558604',
                        address: '新建一路2211号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '徐行镇社区卫生服务中心',
                        tel: '021-59946980',
                        address: '开源路5号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '华亭镇',
                    service: {
                        name: '华亭镇社区事务受理中心',
                        tel: '021-39981040',
                        address: '高石路1433号',
                        time: '周一至周五8:30—17:00 周六至周日8:30—16:01（法定节假日除外）'
                    },
                    police: {
                        name: '华亭镇派出所',
                        tel: '021-59971202',
                        address: '华谊一路188号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '华亭镇社区卫生服务中心',
                        tel: '021-59950820',
                        address: '嘉行公路3285号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '嘉定工业区',
                    service: {
                        name: '嘉定工业区社区事务受理服务中心',
                        tel: '021-69960031',
                        address: '永盛路2703号',
                        time: '周一至周五8:30-17:00  周六至周日8:30-16:00（法定节假日除外）'
                    },
                    police: {
                        name: '',
                        tel: '',
                        address: '',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '工业区社区卫生服务中心',
                        tel: '021-59961145',
                        address: '嘉朱公路1650号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '菊园新区',
                    service: {
                        name: '菊园新区社区事务受理服务中心',
                        tel: '021-69016000',
                        address: '平城路811号',
                        time: '周一至周五8:30-17:00  周六至周日8:30-16:00（法定节假日除外）'
                    },
                    police: {
                        name: '',
                        tel: '',
                        address: '',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '菊园新区社区卫生服务中心',
                        tel: '021-59926282',
                        address: '平城路785号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }
            ]
        }, {
            district: '金山区',
            streets: [
                {
                    name: '石化街道',
                    service: {
                        name: '石化街道社区事务受理中心',
                        tel: '021-57933627',
                        address: '卫零路485号',
                        time: '周一至周五上午8:30-11:15 下午13:30-16:30 周六、周日上午8:30-11:15 （法定节假日除外）'
                    },
                    police: {
                        name: '石化街道派出所',
                        tel: '021-57934110',
                        address: '沪杭公路8718号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '石化街道社区卫生服务中心',
                        tel: '021-57970127',
                        address: '象州路12号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '枫泾镇',
                    service: {
                        name: '枫泾镇社区事务受理中心',
                        tel: '021-57353407',
                        address: '枫杰路51号',
                        time: '周一至周五8:30-17:00  周六至周日8:30-16:00（法定节假日除外）'
                    },
                    police: {
                        name: '枫泾镇派出所',
                        tel: '021-57351300',
                        address: '新枫路130号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '枫泾镇社区卫生服务中心',
                        tel: '021-57361060',
                        address: '枫杰路28号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '朱泾镇',
                    service: {
                        name: '朱泾镇社区事务受理中心',
                        tel: '021-57317431',
                        address: '人民路360号',
                        time: '周一至周五上午8:30-11:00 下午13:00-16:30；周六、周日上午8:30—11:00（法定节假日除外）'
                    },
                    police: {
                        name: '朱泾镇派出所',
                        tel: '021-57320430',
                        address: '临源街655号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '朱泾镇社区卫生服务中心',
                        tel: '021-57326668',
                        address: '朱泾镇罗星南路608号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '亭林镇',
                    service: {
                        name: '亭林镇社区事务受理中心',
                        tel: '021-67235370',
                        address: '亭升路550弄33号',
                        time: '周一至周五8：15-16:45 周六、周日上午8:15-11:15 （法定节假日除外）'
                    },
                    police: {
                        name: '亭林镇派出所',
                        tel: '021-57233669',
                        address: '亭学路110号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '亭林镇社区卫生服务中心',
                        tel: '021-57233516',
                        address: '亭林镇松隐大街456号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '漕泾镇',
                    service: {
                        name: '漕泾镇社区事务受理中心',
                        tel: '021-37250128',
                        address: '漕泾镇中一西路601号',
                        time: '周一至周五8:30-17:00  周六至周日8:30-16:00（法定节假日除外）'
                    },
                    police: {
                        name: '漕泾镇派出所',
                        tel: '021-57252110',
                        address: '海创路399号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '漕泾镇社区卫生服务中心',
                        tel: '021-57255886',
                        address: '中一东路99号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '山阳镇',
                    service: {
                        name: '山阳镇社区事务受理中心',
                        tel: '021-57245390',
                        address: '亭卫路1500号',
                        time: '周一至周五上午8:30-11:00，下午12:45-16:30；周六、周日上午8:30-11:00  （法定节假日除外）'
                    },
                    police: {
                        name: '山阳镇派出所',
                        tel: '021-57242111',
                        address: '海光路77号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '山阳镇社区卫生服务中心',
                        tel: '021-57241224',
                        address: '山阳镇向阳西路88号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '金山卫镇',
                    service: {
                        name: '金山卫镇社区事务受理中心',
                        tel: '021-57260692',
                        address: '卫镇古城路319号',
                        time: '周一至周五上午：8:15—11:15；下午：1：00—4:30 周末上午：8:15—11:15 （节假日除外）'
                    },
                    police: {
                        name: '金山卫镇派出所',
                        tel: '021-57260110',
                        address: '南阳湾路1853号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '金山卫镇社区卫生服务中心',
                        tel: '021-67261178',
                        address: '西静路367号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '张堰镇',
                    service: {
                        name: '张堰镇社区事务受理中心',
                        tel: '021-57213795',
                        address: '张堰镇东贤路951号',
                        time: '周一至周五上午：8:15—11:15；下午：1：00—4:30 周末上午：8:15—11:30 （节假日除外）'
                    },
                    police: {
                        name: '张堰镇派出所',
                        tel: '021-57210110',
                        address: '松金公路2520弄9号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '张堰镇社区卫生服务中心',
                        tel: '021-57211152',
                        address: '张堰大街199号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '廊下镇',
                    service: {
                        name: '廊下镇社区事务受理中心',
                        tel: '021-57395078',
                        address: '金山区景乐路228号',
                        time: '周一至周五上午8:30-16:30;周六、周日上午8:30-11:30 （节假日除外）'
                    },
                    police: {
                        name: '廊下镇派出所',
                        tel: '021-57390110',
                        address: '漕廊公路7855号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '廊下镇社区卫生服务中心',
                        tel: '021-57391353',
                        address: '廊下镇漕廊公路7887号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '吕巷镇',
                    service: {
                        name: '吕巷镇社区事务受理中心',
                        tel: '021-57371365',
                        address: '吕巷镇溪南路58号',
                        time: '周一至周五上午8:30-16:30;周六、周日上午8:30-11:00 （节假日除外）'
                    },
                    police: {
                        name: '吕巷镇派出所',
                        tel: '021-57370110',
                        address: '朱吕公路6988号',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '吕巷镇社区卫生服务中心',
                        tel: '021-57370025',
                        address: '吕巷镇溪北路74号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }, {
                    name: '金山工业区',
                    service: {
                        name: '金山工业区社区事务受理服务中心',
                        tel: '021-57270729',
                        address: '金山工业区恒顺路280弄15号',
                        time: '周一至周五上午8:30-16:30;周六、周日上午8:30-11:00 （节假日除外）'
                    },
                    police: {
                        name: '',
                        tel: '',
                        address: '',
                        time: '周一至周五 上午8:00-12:00 下午2:00-6:00（法定节假日除外）'
                    },
                    hospital: {
                        name: '工业区社区卫生服务中心',
                        tel: '021-59543106',
                        address: '嘉朱公路1650号',
                        time: '上午8:00-11:30 下午13:30-17:00(16：00停止挂号)'
                    }
                }
            ]
        }
    ];
};

LocationSvc.prototype.getDistricts = function() {
    return new Promise((resolve, reject) => {
        var d = [];
        lodash.forEach(this.locations, x => {
            d.push(x.district);
        });
        resolve(d);
    });
};

LocationSvc.prototype.getDetailByName = function(name) {
    return new Promise((resolve, reject) => {
        lodash.forEach(this.locations, x => {
            var obj = lodash.filter(x.streets, (s) => {
                return s.name == name;
            })
            if (obj != null && obj != undefined && obj.length > 0) {
                var objs = {
                    districtName: x.district,
                    streets: x.streets,
                    obj: obj
                };
                resolve(objs);
            }
        })
    })
}

LocationSvc.prototype.getStreetsByDistrict = function(district) {
    return new Promise((resolve, reject) => {
        var target = lodash.find(this.locations, x => {
            return x.district === district;
        });
        resolve(target);
    });
};

LocationSvc.prototype.completeAll = function(strType, district, street, detail) {
    return new Promise((resolve, reject) => {
        request(GLOBAL.SERVER + "/user/saveAddress", {
            strType: strType,
            district: district,
            street: street,
            detail: detail
        }, "POST").then(data => {
            resolve(data);
        })
    })
}

LocationSvc.prototype.getByDetail = function(detail) {
    return new Promise((resolve, reject) => {
        request(GLOBAL.SERVER + "/user/getStreet", {
            address: detail
        }, "POST").then(data => {
            resolve(data);
        })
    })
}

LocationSvc.prototype.getCurrentLocation = function() {
    return new Promise((resolve, reject) => {
        wx.getLocation({
            type: 'wgs84',
            success: function(res) {
                var latitude = res.latitude //纬度
                var longitude = res.longitude //经度
                request(GLOBAL.SERVER + "/user/getLocation/" + longitude + "/" + latitude, null, "GET").then(data => {
                    resolve(data);
                })
            }
        })
    })
}

module.exports = LocationSvc;
