const Promise = require('../utils/promise.min.js');
const _ = require('../utils/lodash.min.js');
const GLOBAL = require('../global.js');
const request = require('../utils/request.js').request;

var LocationSvc = function() {

    this.locations = [
        {
            district: '黄浦区',
            streets: [
                {
                    name: '南京东路街道',
                    service: {
                        name: '南京东路街道社区事务受理中心',
                        tel: '021-63271866',
                        address: '江阴路101号',
                        time: '周一至周日 8:30-16:30'
                    }
                }, {
                    name: '外滩街道',
                    service: {
                        name: '外滩街道社区事务受理中心',
                        tel: '021-63295277',
                        address: '河南中路568号',
                        time: '周一至周日 8:30-16:30 '
                    }
                }, {
                    name: '淮海中路街道',
                    service: {
                        name: '淮海中路街道社区事务受理中心',
                        tel: '021-53832593',
                        address: '马当路349号',
                        time: '周一至周日 上午8：30--11:30 下午13:00-16:30(法定假日除外) '
                    }
                }, {
                    name: '老西门街道',
                    service: {
                        name: '老西门街道社区事务受理中心',
                        tel: '021-63769098',
                        address: '大吉路71号',
                        time: '周一至周日：8：30—16：30（国定假日除外）'
                    }
                }, {
                    name: '五里桥街道',
                    service: {
                        name: '五里桥街道社区事务受理中心',
                        tel: '021-53013030',
                        address: '黄浦区瞿溪路768号',
                        time: '周一至周日：8：30—16：30（国定假日除外）'
                    }
                }, {
                    name: '半淞园路街道',
                    service: {
                        name: '半淞园路街道社区事务受理中心',
                        tel: '021-63122105',
                        address: '黄浦区西藏南路1360号',
                        time: '周一至周日：8：30—16：30（国定假日除外）'
                    }
                }, {
                    name: '豫园街道',
                    service: {
                        name: '豫园街道社区事务受理中心',
                        tel: '021-63365917',
                        address: '梧桐路50号',
                        time: '周一至周日：8：30—16：30（国定假日除外）'
                    }
                }, {
                    name: '小东门街道',
                    service: {
                        name: '小东门街道社区事务受理中心',
                        tel: '021-63325801',
                        address: '黄浦区白渡路252号',
                        time: '周一至周日：8：30—16：30（国定假日除外）'
                    }
                }, {
                    name: '瑞金二路街道',
                    service: {
                        name: '瑞金二路街道社区事务受理中心',
                        tel: '021-53829022',
                        address: '皋兰路6号',
                        time: '周一至周日：8：30—16：30（国定假日除外）'
                    }
                }, {
                    name: '打浦桥街道',
                    service: {
                        name: '打浦桥街道社区事务受理中心',
                        tel: '021-63041102',
                        address: '南塘浜路103号',
                        time: '周一至周日：8：30—16：30（国定假日除外）'
                    }
                }
            ]
        }, {
            district: '徐汇区',
            streets: [
                {
                    name: '湖南路街道 ',
                    service: {
                        name: '湖南路街道社区事务受理中心',
                        tel: '021-64377524',
                        address: '淮海中路1788号',
                        time: '周一至周日8：30——17：00（法定节假日除外）'
                    }
                }, {
                    name: '天平路街道',
                    service: {
                        name: '天平路街道社区事务受理中心',
                        tel: '021-64673312',
                        address: '衡山路17弄1号',
                        time: '周一至周日8：30——17：01（法定节假日除外）'
                    }
                }, {
                    name: '枫林路街道',
                    service: {
                        name: '枫林路街道街道社区事务受理中心',
                        tel: '021-64382999',
                        address: '中山南二路857号',
                        time: '周一至周日8：30——17：02（法定节假日除外）'
                    }
                }, {
                    name: '徐家汇街道',
                    service: {
                        name: '徐家汇街道社区事务受理中心',
                        tel: '021-64417390',
                        address: '斜土路2431号',
                        time: '周一至周日 上午8：30—11:30；下午1:30—5:00'
                    }
                }, {
                    name: '斜土路街道',
                    service: {
                        name: '斜土路街道社区事务受理中心',
                        tel: '021-64045999',
                        address: '茶陵路38号',
                        time: '周一至周日8:30-17:00'
                    }
                }, {
                    name: '长桥路街道',
                    service: {
                        name: '长桥路街道社区事务受理中心',
                        tel: '021-64771771',
                        address: '罗秀路616号',
                        time: '周一至周日8：30——17：00（法定节假日除外）'
                    }
                }, {
                    name: '漕河泾街道',
                    service: {
                        name: '漕河泾街道社区事务受理中心',
                        tel: '021-54480560',
                        address: '冠生园路211号',
                        time: '周一至周五8:30-17:00；11:30-1:30值班（办理部分业务）；周六、周日8:30-17:00（办理部分业务），11:30-1:30休息（以上受理时间法定节假日除外）'
                    }
                }, {
                    name: '虹梅路街道',
                    service: {
                        name: '虹梅路街道社区事务受理中心',
                        tel: '021-34207920',
                        address: '虹梅路2019号',
                        time: '周一至周日8：30——17：00（法定节假日除外）'
                    }
                }, {
                    name: '康健新村街道',
                    service: {
                        name: '康健新村街道社区事务受理中心',
                        tel: '021-54210576',
                        address: '浦北路268号',
                        time: '周一至周日 上午8:30-11:30；下午13:30-17:00'
                    }
                }, {
                    name: '田林路街道',
                    service: {
                        name: '田林路街道社区事务受理中心',
                        tel: '021-64825656',
                        address: '宜山路655弄3号',
                        time: '周一至周日8:30-17:00（周六、周日及法定节假日11:30-13:30不办理业务）'
                    }
                }, {
                    name: '凌云路街道',
                    service: {
                        name: '凌云路街道社区事务受理中心',
                        tel: '021-64552736',
                        address: '老沪闵路1039弄48号',
                        time: '周一至周日8：30——17：00（法定节假日除外）'
                    }
                }, {
                    name: '龙华街道',
                    service: {
                        name: '龙华街道社区事务受理中心',
                        tel: '021-54121059',
                        address: '天钥桥南路399号',
                        time: '周一至周日8：30——17：00（法定节假日除外）'
                    }
                }, {
                    name: '华泾镇',
                    service: {
                        name: '华泾镇社区事务受理中心',
                        tel: '021-54821212',
                        address: '华泾路505号',
                        time: '周一至周日8:30-17:00（法定节假日除外)'
                    }
                }
            ]
        }, {
            district: '长宁区',
            streets: [
                {
                    name: '华阳路街道',
                    service: {
                        name: '华阳路街道社区事务受理中心',
                        tel: '021-62266220',
                        address: '长宁路396弄79号',
                        time: '周一至周日8：30-16：30（法定节假日除外）'
                    }
                }, {
                    name: '新华路街道',
                    service: {
                        name: '新华路街道社区事务受理中心',
                        tel: '021-62941011',
                        address: '法华镇路521号',
                        time: '周一至周日8：30-16：30（法定节假日除外）'
                    }
                }, {
                    name: '江苏路街道',
                    service: {
                        name: '江苏路街道社区事务受理中心',
                        tel: '021-62256600',
                        address: '江苏路563弄8号',
                        time: '周一至周五 8:30－16:30 ；周六至周日 上午8:30－11:30，下午13:30－16:30（法定节假日除外）'
                    }
                }, {
                    name: '天山路街道',
                    service: {
                        name: '天山路街道社区事务受理中心',
                        tel: '021-62281033',
                        address: '娄山关路天山二村64号乙',
                        time: '周一至周日8：30-16：30（法定节假日除外）'
                    }
                }, {
                    name: '周家桥街道',
                    service: {
                        name: '周家桥街道社区事务受理中心虹桥街道社区事务受理中心',
                        tel: '021-52061155',
                        address: '云雾山路551弄48号',
                        time: '周一至周日8：30-16：30（法定节假日除外）'
                    }
                }, {
                    name: '虹桥街道',
                    service: {
                        name: '虹桥街道社区事务受理中心',
                        tel: '021-22850900',
                        address: '中山西路1030弄51号',
                        time: '周一至周五8:30-16:30 双休日8:30-11:30 13:30-16:30（法定节假日除外）'
                    }
                }, {
                    name: '仙霞新村街道',
                    service: {
                        name: '仙霞新村街道社区事务受理中心',
                        tel: '021-62959244',
                        address: '虹古路206号',
                        time: '周一至周日8：30-16：30（法定节假日除外）'
                    }
                }, {
                    name: '程家桥街道',
                    service: {
                        name: '程家桥街道社区事务受理中心',
                        tel: '021-22300100',
                        address: '虹桥路2282号',
                        time: '周一至周日8：30-16：30（法定节假日除外）'
                    }
                }, {
                    name: '北新泾街道',
                    service: {
                        name: '北新泾街道社区事务受理中心',
                        tel: '021-52188321',
                        address: '新泾一村144号',
                        time: '周一至周日8：30-16：30（法定节假日除外）'
                    }
                }, {
                    name: '新泾镇',
                    service: {
                        name: '新泾镇社区事务受理中心',
                        tel: '021-52160606',
                        address: '新泾镇泉口路66号',
                        time: '周一至周日8：30-16：31（法定节假日除外）'
                    }
                }
            ]
        }, {
            district: '静安区',
            streets: [
                {
                    name: '江宁路街道',
                    service: {
                        name: '江宁路街道社区事务受理中心',
                        tel: '021-62668866',
                        address: '常德路818号',
                        time: '周一至周五8：30—17：00 周六、周日9：30—15:30（全年无休）'
                    }
                }, {
                    name: '静安寺街道',
                    service: {
                        name: '静安寺街道社区事务受理中心',
                        tel: '021-54036120',
                        address: '常熟路115号',
                        time: '周一至周五8：30—17：00 周六、周日9：30—15:30（法定节假日除外）'
                    }
                }, {
                    name: '南京西路街道',
                    service: {
                        name: '南京西路街道社区事务受理中心',
                        tel: '021-62897060',
                        address: '延安中路955弄67号',
                        time: '周一至周五:上午8:30—11:30；下午：14：00--17：00周六、周日：9:30—15:30（法定节假日除外）'
                    }
                }, {
                    name: '曹家渡街道',
                    service: {
                        name: '曹家渡街道社区事务受理中心',
                        tel: '021-62112892',
                        address: '万航渡路676弄46号',
                        time: '周一至周五8：30—17：00 周六、周日9：30—15:30（法定节假日除外）'
                    }
                }, {
                    name: '石门二路街道',
                    service: {
                        name: '石门二路街道社区事务受理中心',
                        tel: '021-62675858',
                        address: '静安区武定路139号',
                        time: '周一至周五上午8：30-11：30，下午13：30—17：00；周六、周日9：30-15：30（法定节假日除外）'
                    }
                }
            ]
        }, {
            district: '虹口区',
            streets: [
                {
                    name: '四川北路街道',
                    service: {
                        name: '四川北路街道社区事务受理服务中心',
                        tel: '021-56661380',
                        address: '新广路296号一楼',
                        time: '周一至周五8:30-16:30 周六至周日9:00-16:00（法定节假日除外）'
                    }
                }, {
                    name: '提篮桥街道',
                    service: {
                        name: '提篮桥街道社区事务受理服务中心',
                        tel: '021-65853300',
                        address: '新建路195号',
                        time: '周一至周四8:30-16:30 周五8:30-15:00 周六至周日9:00-16:00（法定节假日除外）'
                    }
                }, {
                    name: '欧阳路街道',
                    service: {
                        name: '欧阳路街道社区事务受理服务中心',
                        tel: '021-65222978',
                        address: '曲阳路483弄1—3号',
                        time: '周一至周五 8:30-16:30 周六、周日 9:00-16:00（法定节假日除外）'
                    }
                }, {
                    name: '广中路街道',
                    service: {
                        name: '广中路街道社区事务受理服务中心',
                        tel: '021-51812222',
                        address: '水电路120号',
                        time: '周一至周五 8:30-16:30 周六、周日 9:00-16:00（法定节假日除外）'
                    }
                }, {
                    name: '凉城新村街道',
                    service: {
                        name: '凉城新村街道社区事务受理服务中心',
                        tel: '021-65290666',
                        address: '凉城路465弄41号甲',
                        time: '周一至周五8:30—11:30；13:30—16:30；双休日：9:00—11:30；13:30—16:00（法定节假日除外）'
                    }
                }, {
                    name: '嘉兴路街道',
                    service: {
                        name: '嘉兴路街道社区事务受理服务中心',
                        tel: '021-65158800',
                        address: '三河路388号',
                        time: '周一至周五 8:30—16:30周六、周日9:00-16:00（国定节假日除外）'
                    }
                }, {
                    name: '曲阳路街道',
                    service: {
                        name: '曲阳路街道社区事务受理服务中心',
                        tel: '021-35391600',
                        address: '伊敏河路88号',
                        time: '周一至周五 8:30-16:30 周六、周日 9:00-16:00（法定节假日除外）'
                    }
                }, {
                    name: '江湾镇街道',
                    service: {
                        name: '江湾镇街道社区事务受理服务中心',
                        tel: '021-65167111',
                        address: '奎照路280号',
                        time: '周一至周四上午8:30-11:30；下午1:00-:4:30（夏令时2：00-4:30）；周五上午8:30-11:30；下午1:00-3:30 双休日上午9:00-11:00；下午1:00-4:00'
                    }
                }
            ]
        }, {
            district: '闸北区',
            streets: [
                {
                    name: '天目西路街道',
                    service: {
                        name: '天目西路街道社区事务受理中心',
                        tel: '021-36392197',
                        address: '沪太路150号',
                        time: '周一至周五7：45-18：00 双休日9：00-16：30全年无休（国定节假日除外）'
                    }
                }, {
                    name: '北站街道',
                    service: {
                        name: '北站街道社区事务受理中心',
                        tel: '021-63809258',
                        address: '南星路40号',
                        time: '周一至周五8:30-11:30，13:30-16:30/夏令时8:30-11:30，14:00-16:30 ； 周六、周日9:00-11:30，13:30-16:00/夏令时9：00-11:30，14:00-16:00'
                    }
                }, {
                    name: '宝山路街道',
                    service: {
                        name: '宝山路街道社区事务受理中心',
                        tel: '021-56301203',
                        address: '宝昌路519号',
                        time: '周一至周五8:30-16:30;周六、周日上午9:00-11:00,下午14:00-16:00'
                    }
                }, {
                    name: '芷江西路街道',
                    service: {
                        name: '芷江西路街道社区事务受理中心',
                        tel: '021-66583382',
                        address: '芷江西路151号',
                        time: '周一至周日8：30——11:30，13：30——16:30 (夏令时14:00-16:30)'
                    }
                }, {
                    name: '共和新路街道',
                    service: {
                        name: '共和新路街道事务受理中心',
                        tel: '021-56039488',
                        address: '平型关路487号',
                        time: '周一至周日上午 8：30—11：30 下午 13：30—16：30'
                    }
                }, {
                    name: '大宁路街道',
                    service: {
                        name: '大宁路街道社区事务受理中心',
                        tel: '021-56658320',
                        address: '彭江路188号',
                        time: '周一至周五9:00-16：30 周六、周日上午9：00-11：30 下午13：30-16：30（国家法定节假日除外）'
                    }
                }, {
                    name: '彭浦新村街道',
                    service: {
                        name: '彭浦新村街道社区事务受理中心',
                        tel: '021-56478800',
                        address: '安泽路78号',
                        time: '周一至周日上午8:30—11:30 下午13:30—16:30 (国家法定节假日除外)'
                    }
                }, {
                    name: '临汾路街道',
                    service: {
                        name: '临汾路街道社区事务受理中心',
                        tel: '021-66987770',
                        address: '临汾路335号',
                        time: '周一至周五8:00-18:00  双休日上午9:00-11:30  下午1:30-4:30'
                    }
                }, {
                    name: '彭浦镇',
                    service: {
                        name: '彭浦镇社区事务受理中心',
                        tel: '021-56772537',
                        address: '灵石路725号丙',
                        time: '周一至周日上午8:30-11:30,下午13:30-16:30（国家法定节假日除外）'
                    }
                }
            ]
        }, {
            district: '崇明县',
            streets: [
                {
                    name: '城桥镇',
                    service: {
                        name: '城桥镇社区事务受理中心',
                        tel: '021-69617130',
                        address: '城桥镇寒山寺路164号',
                        time: '周一至周五 8:30-17:00（国定假除外）周六、周日8:30-11:15 13:30-17:00（国定假除外）'
                    }
                }, {
                    name: '堡镇镇',
                    service: {
                        name: '堡镇镇新河镇社区事务受理中心社区事务受理中心',
                        tel: '021-59410413',
                        address: '堡镇化工路17号',
                        time: '周一至周日上午8:00-11:15 下午13:00-16:00（国定假除外）'
                    }
                }, {
                    name: '新河镇',
                    service: {
                        name: '新河镇社区事务受理中心',
                        tel: '021-59687397',
                        address: '新河镇新申路801号',
                        time: '周一至周日 上午8:30~11:30 下午13:30~16:30（国定假除外）'
                    }
                }, {
                    name: '庙镇镇',
                    service: {
                        name: '庙镇镇社区事务受理中心',
                        tel: '021-59365379',
                        address: '剧场路6号',
                        time: '周一至周日8:30-16:00（国定假除外）'
                    }
                }, {
                    name: '竖新镇',
                    service: {
                        name: '竖新镇社区事务受理中心',
                        tel: '021-59495305',
                        address: '竖新镇响椿路60号',
                        time: '周一至周日8:30-16:00（国定假除外）'
                    }
                }, {
                    name: '向化镇',
                    service: {
                        name: '向化镇社区事务受理中心',
                        tel: '021-59441064',
                        address: '向化大街149号',
                        time: '周一至周五8:00-11:00 13:30-16:30 周六、周日上午8:30-11:00 下午13:30-15:30 (国定节假日除外）'
                    }
                }, {
                    name: '三星镇',
                    service: {
                        name: '三星镇社区事务受理中心',
                        tel: '021-39600024',
                        address: '三星镇宏海路4291号',
                        time: '周一至周日 8:00-16:00 (国定节假日除外）'
                    }
                }, {
                    name: '港沿镇',
                    service: {
                        name: '港沿镇社区事务受理中心',
                        tel: '021-59462567',
                        address: '港沿镇建联路1138号 ',
                        time: '周一至周日8:30-16:30(国定节假日除外）'
                    }
                }, {
                    name: '中兴镇',
                    service: {
                        name: '中兴镇社区事务受理中心',
                        tel: '021-39440027',
                        address: '中兴镇广福路37号',
                        time: '周一至周日上午8:00-11:00 13:30-16:30(国定节假日除外）'
                    }
                }, {
                    name: '陈家镇',
                    service: {
                        name: '陈家镇社区事务受理中心',
                        tel: '021-59403665',
                        address: '陈家镇北城公路1454号',
                        time: '周一至周日 8:00-11:00 13:00-16:00(国定节假日除外）'
                    }
                }, {
                    name: '绿华镇',
                    service: {
                        name: '绿华镇社区事务受理中心',
                        tel: '021-59351568',
                        address: '绿华镇嘉华路8号',
                        time: '周一至周日上午8:30-11:30 下午13:30-16:30(国定节假日除外）'
                    }
                }, {
                    name: '港西镇',
                    service: {
                        name: '港西镇社区事务受理中心',
                        tel: '021-59671520',
                        address: '港西镇三双公路1573号 ',
                        time: '周一至周日8:30-16:30 (国定节假日除外 ）'
                    }
                }, {
                    name: '建设镇',
                    service: {
                        name: '建设镇社区事务受理中心',
                        tel: '021-39628027',
                        address: '建设镇建星路108号 ',
                        time: '周一至周日8:30-16:30 (国定节假日除外 ）'
                    }
                }, {
                    name: '新村乡',
                    service: {
                        name: '新村乡社区事务受理中心',
                        tel: '021-59650090',
                        address: '新村乡星村公路2107号',
                        time: '周一至周日8:30-16:30 (国定节假日除外 ）'
                    }
                }, {
                    name: '长兴乡',
                    service: {
                        name: '长兴镇社区事务受理中心',
                        tel: '021-56854939',
                        address: '长兴镇凤凰街5号',
                        time: '周一至周五8:00--16:00周六周日8:00--11:00 13:00--16:00 (国定节假日除外 ）'
                    }
                }, {
                    name: '横沙乡',
                    service: {
                        name: '横沙乡社区事务受理中心',
                        tel: '021-56899074',
                        address: '横沙乡新环路57号',
                        time: '周一至周五8:30-16:30 周六、周日上午8:30-11:30 下午13:00-16:30(国定节假日除外 ）'
                    }
                }, {
                    name: '东平镇',
                    service: {
                        name: '东平镇社区事务受理服务中心',
                        tel: '021—59666777',
                        address: '东平镇长江农场长江大街黄河路口',
                        time: '周一至周日 上午8:30—11:30 下午13:30—16:30(国定节假日除外 ）'
                    }
                }, {
                    name: '新海镇',
                    service: {
                        name: '新海镇社区事务受理服务中心',
                        tel: '021-59655101',
                        address: '新海镇海展路80号',
                        time: '周一至周日上午8:30-下午16:00(国定节假日除外 ）'
                    }
                }
            ]
        }, {
            district: '杨浦区',
            streets: [
                {
                    name: '定海路街道',
                    service: {
                        name: '定海路街道社区事务受理中心',
                        tel: '021-65207539',
                        address: '长阳路3066号',
                        time: '周一至周日 上午8:30-11:30 下午13:30-17:00'
                    }
                }, {
                    name: '大桥街道',
                    service: {
                        name: '大桥街道社区事务受理中心',
                        tel: '021-65701838',
                        address: '平凉路1730号',
                        time: '周一至周日上午8：30-11:30 下午13:30-17:00 夏令时下午14:00-17:00'
                    }
                }, {
                    name: '平凉路街道',
                    service: {
                        name: '平凉路街道社区事务受理中心',
                        tel: '021-65850951',
                        address: '吉林路18号',
                        time: '周一至周日上午8:30-11:30 下午13:30-17:00 夏令时下午14:00-17:00（国定节假日除外）'
                    }
                }, {
                    name: '江浦路街道',
                    service: {
                        name: '江浦路街道社区事务受理中心',
                        tel: '021-65853533',
                        address: '许昌路1150号',
                        time: '周一至周日 上午8:30-11:30 下午1:30-5:00（夏令时下午2:00-5:00)国定节假日除外'
                    }
                }, {
                    name: '控江路街道',
                    service: {
                        name: '控江路街道社区事务受理中心',
                        tel: '021-55803280',
                        address: '周家嘴路3209号',
                        time: '周一至周日上午8:30-11:30 下午13:30-17:00 夏令时下午14:00-17:00（国定节假日除外）'
                    }
                }, {
                    name: '殷行街道',
                    service: {
                        name: '殷行街道社区事务受理中心',
                        tel: '021-65063740',
                        address: '国和路1047号',
                        time: '周一至周日8：30-17：00（法定节假日除外）'
                    }
                }, {
                    name: '长白新村街道',
                    service: {
                        name: '长白新村街道社区事务受理中心',
                        tel: '021-65482211',
                        address: '延吉东路107号',
                        time: '周一至周日 上午8:30-11:30 下午13:30-17:00（夏令时14:00-17:00）（国定节假日除外）'
                    }
                }, {
                    name: '延吉新村街道',
                    service: {
                        name: '延吉新村街道社区事务受理中心',
                        tel: '021-65482211',
                        address: '延吉中路77号',
                        time: '周一至周五  8:30-17:00  周六、周日08:30-11:30 13:30-17:00（国定节假日除外）'
                    }
                }, {
                    name: '五角场街道',
                    service: {
                        name: '五角场街道社区事务受理中心',
                        tel: '021-55621137',
                        address: '政通路100弄11号',
                        time: '周一至周五8:30-17:00 周六、日8:30-11:30,13:30-17:00（国定节假日除外，夏令时另行通知）'
                    }
                }, {
                    name: '四平路街道',
                    service: {
                        name: '四平路街道社区事务受理中心',
                        tel: '021-65145236',
                        address: '鞍山路158号',
                        time: '周一至周日 上午8：30-11：30下午13：30-17：00（国定节假日除外）'
                    }
                }, {
                    name: '新江湾城街道',
                    service: {
                        name: '新江湾城街道社区事务受理中心',
                        tel: '021-55130258',
                        address: '政悦路329号',
                        time: '周一至周日 上午8:30-11:30 ，下午13:30-17:00（夏令时下午14:00-17:00）（国定节假日除外）'
                    }
                }, {
                    name: '五角场镇',
                    service: {
                        name: '五角场镇社区事务受理服务中心',
                        tel: '021-65564636',
                        address: '国和路425号',
                        time: '周一至周日上午8:30-11:30，下午13:30-17:00（夏令时间周一至周日上午8:30-11:30，下午14:00-17:00）'
                    }
                }
            ]
        }, {
            district: '普陀区',
            streets: [
                {
                    name: '长寿路街道',
                    service: {
                        name: '长寿街道社区事务受理服务中心',
                        tel: '021-62277887',
                        address: '普陀区胶州路1087号',
                        time: '周一至周五8:30-11:30 14：00-16:30 双休日9:00-11:30 13:30-16：30(国定节假日除外）'
                    }
                }, {
                    name: '曹杨新村街道',
                    service: {
                        name: '曹杨新村街道社区事务受理服务中心',
                        tel: '021-62167000',
                        address: '枫桥路8号',
                        time: '周一至周日 上午8:30-11:30 下午1:30-4:30（国定节假日除外）夏令时下午2:00-4:30'
                    }
                }, {
                    name: '长风新村街道',
                    service: {
                        name: '长风新村街道社区事务受理服务中心',
                        tel: '021-62573789',
                        address: '枣阳路251弄99号',
                        time: '周一至周五 8 ：30-16：30 周六、周日：9:00-11:30 13：30-16：30（法定节假日除外） 夏令时：周六、周日：9：00-11：30 14：00-16：30（法定节假日除外）'
                    }
                }, {
                    name: '宜川路街道',
                    service: {
                        name: '宜川路街道社区事务受理服务中心',
                        tel: '021-56080729',
                        address: '华阴路296号',
                        time: '周一至周五 8 ：30-16：30 周六、周日：9:00-11:30 13：30-16：30（法定节假日除外）夏令时周六、周日：9：00-11：30 14：00-16：31（法定节假日除外）'
                    }
                }, {
                    name: '甘泉路街道',
                    service: {
                        name: '甘泉路街道社区事务受理服务中心',
                        tel: '021-66252255',
                        address: '宜君路9号',
                        time: '周一至周日上午8：30-11:30 下午13:30-16：30 6-9月夏令时下午14：00-16：30（国定节假日除外）'
                    }
                }, {
                    name: '石泉路街道',
                    service: {
                        name: '石泉路街道社区事务受理服务中心',
                        tel: '021-60837528',
                        address: '宁强路25号b楼',
                        time: '周一至周五 8:30-11:30 13:30-16:30 双休日9:00-11:30 13:30-16:30（国家法定假日除外）'
                    }
                }, {
                    name: '真如镇',
                    service: {
                        name: '真如镇社区事务受理服务中心',
                        tel: '021-52768994',
                        address: '铜川路1809号',
                        time: '周一至周日（国家法定节假日除外）上午8:30-11:30 下午13:30-16:30（夏令14:00-16:30）'
                    }
                }, {
                    name: '长征镇',
                    service: {
                        name: '长征镇社区事务受理服务中心',
                        tel: '021-62062200',
                        address: '清峪路12号(近清峪路)',
                        time: '周一至周五 8:30-16:30 周六、周日 9:00-11:30，13:30-16:30（国定节假日除外）'
                    }
                }, {
                    name: '桃浦镇',
                    service: {
                        name: '桃浦镇社区事务受理服务中心',
                        tel: '021-66267866',
                        address: '绿杨路225号',
                        time: '周一至周五 上午8:30-11:30 下午1:30-4:30 周六、周日：上午9:00-11:30 下午1:30-4:30（国定节假日除外）'
                    }
                }
            ]
        }, {
            district: '宝山区',
            streets: [
                {
                    name: '吴淞街道',
                    service: {
                        name: '吴淞街道社区事务受理中心',
                        tel: '021-56572070',
                        address: '淞青路151号',
                        time: '周一至周五：8:30-17:00 周六、周日：8:30-11:00 13:30-16:30（法定节假日除外）'
                    }
                }, {
                    name: '张庙街道',
                    service: {
                        name: '张庙街道社区事务受理中心',
                        tel: '021-56762616',
                        address: '泗塘二村108号',
                        time: '周一至周五：上午：8:30-11:00 下午：13:00-16:30 周六、周日：上午：8:30-11:00 下午：13:00-15:00（国定假日除外）'
                    }
                }, {
                    name: '友谊路街道',
                    service: {
                        name: '友谊路街道社区事务受理中心',
                        tel: '021-56122006',
                        address: '永清路899号',
                        time: '周一至周五上午8：30-17：00 周六、周日上午8：30-11：00 下午13：00-16：30（国定假日除外）'
                    }
                }, {
                    name: '庙行镇',
                    service: {
                        name: '庙行镇社区事务受理中心',
                        tel: '021-56475979',
                        address: '长江西路2700号',
                        time: '周一至周五8:30-16:30 周六、周日上午8:30-11:30 下午13:00-16:30（国定假日除外）'
                    }
                }, {
                    name: '罗店镇',
                    service: {
                        name: '罗店镇社区事务受理中心',
                        tel: '021-56865420',
                        address: '祁北东路209号',
                        time: '周一至周五8:30-16:30 周六、周日9:00-16:00（法定节假日除外）'
                    }
                }, {
                    name: '大场镇',
                    service: {
                        name: '大场镇社区事务受理中心',
                        tel: '021-61671000',
                        address: '沪太路2518号',
                        time: '冬令时(10月1日-4月30日):周一至周日8:30-11:30 下午13:00-16:30 夏令时(5月1日-9月30日)：周一至周日上午8:30-11:30下午13:30 -17:00（国定假日除外）'
                    }
                }, {
                    name: '顾村镇',
                    service: {
                        name: '顾村镇社区事务受理中心',
                        tel: '021-66048603',
                        address: '顾村镇电台南路7号',
                        time: '周一至周五 上午8：30-11：00 下午13：00-16：30 夏令时间（6月15日至9月15日）：上午8：30-11：00 下午13：30-16：30 周六周日上午8：30-11：00下午13：00-16：00  （国定假日除外）'
                    }
                }, {
                    name: '罗泾镇',
                    service: {
                        name: '罗泾镇社区事务受理中心',
                        tel: '021-56873707',
                        address: '萧月路7号',
                        time: '周一至周五8.30-16.30  周六、周日8:30-15:00（国定假日除外）'
                    }
                }, {
                    name: '杨行镇',
                    service: {
                        name: '杨行镇社区事务受理中心',
                        tel: '021-56801939',
                        address: '松兰路826号(近宝杨路)',
                        time: '周一至周日上午8:30-11:00 下午13:00-16:30'
                    }
                }, {
                    name: '月浦镇',
                    service: {
                        name: '月浦镇社区事务受理服务中心',
                        tel: '021-36303971',
                        address: '德都路111号',
                        time: '周一至周五8：30-11：00 13：00-16：30'
                    }
                }, {
                    name: '淞南镇',
                    service: {
                        name: '淞南镇社区事务受理中心',
                        tel: '021-66186516',
                        address: '长江南路595号',
                        time: '周一至周五8:30-16:30 周六、周日8:30-11:30 13:30-16:30（国定假日除外）'
                    }
                }, {
                    name: '高境镇',
                    service: {
                        name: '高境镇社区事务受理中心',
                        tel: '021-66793002',
                        address: '河曲路108号',
                        time: '周一至周五8:30-16:30   夏令时周一至周五8:30-17:00 周六、周日上午9:00-11:00下午13:00-16:00（国定假日除外）'
                    }
                }
            ]
        }, {
            district: '浦东新区',
            streets: [
                {
                    name: '潍坊新村街道',
                    service: {
                        name: '潍坊新村街道社区事务受理中心',
                        tel: '021-51029075',
                        address: '浦东新区潍坊路131弄1号',
                        time: '周一至周日 8:30－11:30 13:30-17:00（国定假日除外）'
                    }
                }, {
                    name: '陆家嘴街道',
                    service: {
                        name: '陆家嘴街道社区事务受理中心',
                        tel: '021-68767121',
                        address: '栖霞路120号',
                        time: '周一至周五8:30-17:00 周六、周日上午8:30-11:30 下午13:30-17:00（国定假日除外）'
                    }
                }, {
                    name: '塘桥街道',
                    service: {
                        name: '塘桥街道社区事务受理中心',
                        tel: '021-50396199',
                        address: '峨山路488号',
                        time: '周一至周日上午8:30-11:30 下午13:30-17:00（国定假日除外）'
                    }
                }, {
                    name: '周家渡街道',
                    service: {
                        name: '周家渡街道社区事务受理中心',
                        tel: '021-50775798',
                        address: '南码头路1136弄35号乙',
                        time: '周一至周日 8:30-17:00(国定节假日除外)'
                    }
                }, {
                    name: '东明路街道',
                    service: {
                        name: '东明路街道社区事务受理中心',
                        tel: '021-68303920',
                        address: '上南路4206弄1-3号',
                        time: '周一至周日 上午8:30-11:30 下午13:30-16:30 夏令时接待时间: 上午8:30-11:30 下午14:00-16:30(国定节假日除外)'
                    }
                }, {
                    name: '洋泾街道',
                    service: {
                        name: '洋泾街道社区事务受理中心',
                        tel: '021-38992151',
                        address: '浦东新区巨野路219号',
                        time: '周一至周日 上午8:30-11:30  下午13:30-17:00 (国定节假日除外)'
                    }
                }, {
                    name: '上钢新村街道',
                    service: {
                        name: '上钢新村街道社区事务受理中心',
                        tel: '021-51923232',
                        address: '昌里路335号(近浦东商场)',
                        time: '周一至周日 8:30-17:00（国定节假日除外）'
                    }
                }, {
                    name: '沪东新村街道',
                    service: {
                        name: '沪东新村街道社区事务受理中心',
                        tel: '021-58503009',
                        address: '兰城路259号',
                        time: '周一至周日 上午8:20-11:35 下午13:20-17:05（国定假除外）'
                    }
                }, {
                    name: '金杨新村街道',
                    service: {
                        name: '金杨新村街道社区事务受理中心',
                        tel: '021-50370500',
                        address: '银山路330号',
                        time: '周一至周日 上午8:25-11:35 下午13:25-16:35(国定节假日除外)'
                    }
                }, {
                    name: '浦兴路街道',
                    service: {
                        name: '浦兴路街道社区事务受理服务中心',
                        tel: '021-50256305',
                        address: '凌河路69号',
                        time: '周一至周五 8:30-11:30 13:30-17:00'
                    }
                }, {
                    name: '南码头路街道',
                    service: {
                        name: '南码头路街道社区事务受理中心',
                        tel: '021-50396125',
                        address: '南码头路400号',
                        time: '周一至周五 上午8:30-11:30 下午13:30-17:00 周六、周日上午 9:00-11:30 下午13:30-16:30（国定节假日除外）'
                    }
                }, {
                    name: '花木街道',
                    service: {
                        name: '花木街道社区事务受理中心',
                        tel: '021-50452710',
                        address: '梅花路291号',
                        time: '周一至周日 上午8:30-11:30 下午13:30-17:00（国定假除外）'
                    }
                }, {
                    name: '川沙新镇',
                    service: {
                        name: '川沙新镇社区事务受理中心',
                        tel: '021-68397955',
                        address: '川沙新镇妙境路1336号',
                        time: '周一至周日 上午8:30-11:30 下午13:30-16:30（国定假除外）'
                    }
                }, {
                    name: '合庆镇',
                    service: {
                        name: '合庆镇社区事务受理中心',
                        tel: '021-58971201',
                        address: '东川公路7777号1号楼',
                        time: '周一至周日 上午8:30-11:30 下午13:30-16:30（国定假除外）'
                    }
                }, {
                    name: '曹路镇',
                    service: {
                        name: '曹路镇社区事务受理中心',
                        tel: '021-50688686',
                        address: '龚丰路85号',
                        time: '周一至周日 上午8:30-11:30 下午13:30-16:30（国定假除外）'
                    }
                }, {
                    name: '高东镇',
                    service: {
                        name: '高东镇社区事务受理中心',
                        tel: '021-58486215',
                        address: '高东光明路433号',
                        time: '周一至周日 8:30-16:30(国定节假日除外)'
                    }
                }, {
                    name: '高桥镇',
                    service: {
                        name: '高桥镇社区事务受理中心',
                        tel: '021-50581766',
                        address: '张杨北路5168号',
                        time: '周一至周日 8:30-16:30(国定节假日除外)'
                    }
                }, {
                    name: '高行镇',
                    service: {
                        name: '高行镇社区事务受理中心',
                        tel: '021-68974238',
                        address: '新行路340号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 (国定节假日除外）'
                    }
                }, {
                    name: '金桥镇',
                    service: {
                        name: '金桥镇社区事务受理中心',
                        tel: '021-58995295',
                        address: '佳林路585号3号楼',
                        time: '周一至周日 8:30-16:30（节日除外）'
                    }
                }, {
                    name: '张江镇',
                    service: {
                        name: '张江镇社区事务受理中心',
                        tel: '021-50793310',
                        address: '张江镇张江路1458号',
                        time: '周一至周日 上午8:30-11:30 下午13:30-16:30（国定节假日除外）'
                    }
                }, {
                    name: '唐镇',
                    service: {
                        name: '唐镇社区事务受理中心',
                        tel: '021-68381116',
                        address: '唐镇唐兴路495号',
                        time: '周一至周日 上午8:30-11:30 下午13:30-16:30（国定节假日除外）'
                    }
                }, {
                    name: '北蔡镇',
                    service: {
                        name: '北蔡镇社区事务受理中心',
                        tel: '021-68926111',
                        address: '沪南路1105号',
                        time: '周一至周五 8:30-17:00（国定节假日除外）'
                    }
                }, {
                    name: '三林镇',
                    service: {
                        name: '三林镇社区事务受理中心',
                        tel: '021-50823008',
                        address: '长清路2188号',
                        time: '周一至周日 上午8:30-11:30 下午13:00-16:30 周一至周五8:30-11:30 下午13:00-16:30 （国定节假日除外）'
                    }
                }, {
                    name: '申港街道',
                    service: {
                        name: '申港街道社区事务受理中心',
                        tel: '021-38072001',
                        address: '临港新城环湖西一路99号主',
                        time: '周一至周五 8:30-11:30  13:00-17:00（国定节假日除外） '
                    }
                }, {
                    name: '惠南镇',
                    service: {
                        name: '惠南镇社区事务受理中心街道',
                        tel: '021-68090232',
                        address: '人民西路555号',
                        time: '周一至周五8:30-11:30 13:00-16:30（国定节假日除外）'
                    }
                }, {
                    name: '新场镇',
                    service: {
                        name: '新场镇社区事务受理中心',
                        tel: '021-58171717',
                        address: '新场镇新奉公路331号',
                        time: '周一至周五 上午8:30-11:00 下午13:00-16:30 周六、周日上午8:30-11:00 下午13:00-16:00（国定假日除外）'
                    }
                }, {
                    name: '大团镇',
                    service: {
                        name: '大团镇社区事务受理中心',
                        tel: '021-58081037',
                        address: '大团镇永春东路10号',
                        time: '周一至周五 上午8:30-11:00 下午13:00-16:30 周六、周日上午8:30-11:00 下午13:00-16:00（国定假日除外）'
                    }
                }, {
                    name: '周浦镇',
                    service: {
                        name: '周浦镇社区事务受理中心',
                        tel: '021-20922225',
                        address: '祝家港路190号',
                        time: '周一至周五 上午8:30-11：00 下午13：00-16:30 周六、周日上午8:30-11:00 下午13:00-16:00（国定假日除外）'
                    }
                }, {
                    name: '航头镇',
                    service: {
                        name: '航头镇社区事务受理中心',
                        tel: '021-58229649',
                        address: '航头镇航头路188号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    }
                }, {
                    name: '芦潮港镇',
                    service: {
                        name: '芦潮港镇社区事务受理中心',
                        tel: '021-20942117',
                        address: '芦潮港镇芦硕路298号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    }
                }, {
                    name: '康桥镇',
                    service: {
                        name: '康桥镇社区事务受理中心',
                        tel: '021-58121340',
                        address: '沪南路2538号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    }
                }, {
                    name: '宣桥镇',
                    service: {
                        name: '宣桥镇社区事务受理中心',
                        tel: '021-58186291',
                        address: '宣桥镇六奉公路128号',
                        time: '周一至周日 上午8:30-11:20 下午13:30-16:30'
                    }
                }, {
                    name: '六灶镇',
                    service: {
                        name: '六灶街道社区事务受理服务中心',
                        tel: '021-58162546',
                        address: '周祝公路2378号',
                        time: '周一至周五 上午 8:30-11:30 下午 12:30－16:30 （国定假日除外）'
                    }
                }, {
                    name: '祝桥镇',
                    service: {
                        name: '祝桥镇社区事务受理中心',
                        tel: '021-58108833',
                        address: '祝桥镇南祝公路5058号',
                        time: '周一至周日 8:30-16:30（国定节假日除外）'
                    }
                }, {
                    name: '泥城镇',
                    service: {
                        name: '泥城镇社区事务受理中心',
                        tel: '021-58071212',
                        address: '鸿音路3152号',
                        time: '周一至周日 8:30-16:30（国定节假日除外）'
                    }
                }, {
                    name: '书院镇',
                    service: {
                        name: '书院镇社区事务受理中心',
                        tel: '021-58198707',
                        address: '书院镇新卫路8号',
                        time: '周一至周五8:30—16:30 周六周日8:30-16:00（国定节假日除外）'
                    }
                }, {
                    name: '万祥镇',
                    service: {
                        name: '万祥镇社区事务受理中心',
                        tel: '021-58042117',
                        address: '万祥镇万和路188号',
                        time: '周一至周五：8:00-16:30；周六、周日：8:30-16:00（国定节假日除外）'
                    }
                }, {
                    name: '老港镇',
                    service: {
                        name: '老港镇社区事务受理中心',
                        tel: '021-58051106',
                        address: '老港镇建中路556号',
                        time: '周一至周五 上午8:30-11:30 下午13:00-16:30 周六、周日上午8:30-11:00 下午13:30-16:00（国定节假日除外）'
                    }
                }
            ]
        }, {
            district: '浦东新区',
            streets: [
                {
                    name: '江川路街道',
                    service: {
                        name: '江川街道社区事务受理服务中心',
                        tel: '021-64622694',
                        address: '鹤庆路398号',
                        time: '周一至周五 8:30-11:30 13:30-16:30（国定节假日除外）'
                    }
                }, {
                    name: '龙柏街道',
                    service: {
                        name: '龙柏街道社区事务受理服务中心',
                        tel: '021-64215151',
                        address: '航东路355号',
                        time: '周一至周五 8:30-11:30 13:30-16:30（国定节假日除外）'
                    }
                }, {
                    name: '古美街道',
                    service: {
                        name: '古美街道社区事务受理中心',
                        tel: '021-54163600',
                        address: '古龙路1139号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    }
                }, {
                    name: '莘庄镇',
                    service: {
                        name: '莘庄镇社区事务受理中心',
                        tel: '021-54163600',
                        address: '莘西南路158号1号楼',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    }
                }, {
                    name: '七宝镇',
                    service: {
                        name: '七宝镇社区事务受理中心',
                        tel: '021-54791001',
                        address: '沪松公路577号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    }
                }, {
                    name: '浦江镇',
                    service: {
                        name: '浦江镇社区事务受理中心',
                        tel: '021-34302140',
                        address: '浦瑞路326号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    }
                }, {
                    name: '梅陇镇',
                    service: {
                        name: '梅陇镇社区事务受理中心',
                        tel: '021-64101122',
                        address: '莘朱路1925号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    }
                }, {
                    name: '虹桥镇',
                    service: {
                        name: '虹桥镇社区事务受理中心',
                        tel: '021-64658822',
                        address: '合川路2885号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    }
                }, {
                    name: '马桥镇',
                    service: {
                        name: '马桥镇社区事务受理中心',
                        tel: '021-64099686',
                        address: '马桥镇银春路2016号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    }
                }, {
                    name: '吴泾镇',
                    service: {
                        name: '吴泾镇社区事务受理中心',
                        tel: '021-54737105',
                        address: '龙吴路5530弄40号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    }
                }, {
                    name: '华漕镇',
                    service: {
                        name: '华漕镇社区事务受理中心',
                        tel: '021-33509620',
                        address: '平乐路25号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    }
                }, {
                    name: '颛桥镇',
                    service: {
                        name: '颛桥镇社区事务受理中心',
                        tel: '021-51987090',
                        address: '联农路297号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    }
                }, {
                    name: '莘庄工业区街道',
                    service: {
                        name: '莘庄工业区社区事务受理服务中心',
                        tel: '021-34909876',
                        address: '春光路710号',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    }
                }, {
                    name: '新虹街道',
                    service: {
                        name: '新虹街道社区事务受理服务中心',
                        tel: '021-52962133',
                        address: '申滨路777号1楼',
                        time: '周一至周日 上午8:30-11:00 下午13:00-16:30 （国定假日除外）'
                    }
                }
            ]
        }, {
            district: '奉贤区',
            streets: [
                {
                    name: '南桥镇',
                    service: {
                        name: '南桥镇社区事务受理中心',
                        tel: '021-67194346',
                        address: '环城西路477号',
                        time: '周一至周五 8:30-16:30(夏天17:00) 周六、周日8:30-11:00 13:00-16:00'
                    }
                }, {
                    name: '庄行镇',
                    service: {
                        name: '庄行镇社区事务受理中心',
                        tel: '021-57469107',
                        address: '庄行镇新苑路2号',
                        time: '周一至周日上午8:30-11:00 下午13:30-16:30(法定节假日除外)'
                    }
                }, {
                    name: '金汇镇',
                    service: {
                        name: '金汇镇社区事务受理中心',
                        tel: '021-57481183',
                        address: '金汇镇金碧路2028号大尧路南',
                        time: '周一至周日 8:30-16:30'
                    }
                }, {
                    name: '柘林镇',
                    service: {
                        name: '柘林镇社区事务受理中心',
                        tel: '021-57446187',
                        address: '柘林镇钦林北路56号',
                        time: '周一至周日8:30-11:00 13:00-16:30(法定国假日除外)'
                    }
                }, {
                    name: '青村镇',
                    service: {
                        name: '青村镇社区事务受理中心',
                        tel: '021-57562097',
                        address: '青村镇南奉公路2729号',
                        time: '周一至周日上午8：30—11：30 下午13：00—16：30（除法定节假日）'
                    }
                }, {
                    name: '奉城镇',
                    service: {
                        name: '奉城镇社区事务受理中心',
                        tel: '021-57520547',
                        address: '兰博路2009号',
                        time: '周一至周五 上午8：30-11：30 下午13：00-17：00 周六、周日 上午9：00-11：00 下午13：00-15：30 （国定节假日除外）'
                    }
                }, {
                    name: '四团镇',
                    service: {
                        name: '四团镇社区事务受理中心',
                        tel: '021-57533152',
                        address: '四团镇天鹏街54弄32-35号',
                        time: '周一至周五 8：30-16：30 周六、周日上午8：30-11：00，下午13：30-16：00 （国定节假日除外）'
                    }
                }, {
                    name: '海湾镇',
                    service: {
                        name: '海湾镇社区事务受理中心',
                        tel: '021-57504779',
                        address: '星火农场海农公路1478号',
                        time: '周一至周五 上午8：30-11:30，下午2:00-5:00（国定节假日除外）'
                    }
                }
            ]
        }, {
            district: '青浦区',
            streets: [
                {
                    name: '夏阳街道',
                    service: {
                        name: '夏阳街道社区事务受理中心',
                        tel: '021-59731779',
                        address: '青浦区城中南路58号',
                        time: '周一至周日上午8:30-11:30 下午14:00-17:00（法定节假日除外）'
                    }
                }, {
                    name: '盈浦街道',
                    service: {
                        name: '盈浦街道社区事务受理中心',
                        tel: '021-69223601',
                        address: '青浦区胜利路119号',
                        time: '周一至周日上午8:30—11:15 下午14:00—17:00(法定节假日除外）'
                    }
                }, {
                    name: '香花桥街道',
                    service: {
                        name: '香花桥街道社区事务受理中心',
                        tel: '021-59221919',
                        address: '青浦区香大路1001号',
                        time: '周一至周日上午8:30-11:30 下午13:30-16:30（法定节假日除外）'
                    }
                }, {
                    name: '赵巷镇',
                    service: {
                        name: '赵巷镇社区事务受理中心',
                        tel: '021-59750070',
                        address: '青浦区赵巷镇镇中路580号',
                        time: '周一至周日上午8:30—11:30 下午13:00—16:30（法定节假日除外）'
                    }
                }, {
                    name: '徐泾镇',
                    service: {
                        name: '徐泾镇社区事务受理中心',
                        tel: '021-59760342',
                        address: '徐泾镇明珠路800号',
                        time: '周一至周日上午8:30—11:00 下午13:00—16:30(法定节假日除外）'
                    }
                }, {
                    name: '华新镇',
                    service: {
                        name: '华新镇社区事务受理中心',
                        tel: '021-59797741',
                        address: '华新镇华强街585号',
                        time: '周一至周日上午8:30-11:30 下午13:30-16:30(法定节假日除外）'
                    }
                }, {
                    name: '重固镇',
                    service: {
                        name: '重固镇社区事务受理中心',
                        tel: '021-59786333',
                        address: '赵重公路3025号',
                        time: '周一至周日上午8:30-11:30 下午13:30-16:30(法定节假日除外）'
                    }
                }, {
                    name: '白鹤镇',
                    service: {
                        name: '白鹤镇社区事务受理中心',
                        tel: '021-59212666',
                        address: '赵屯建屯路130号5号楼',
                        time: '周一至周日上午8:30-11:30 下午13:30-16:30（法定节假日除外）'
                    }
                }, {
                    name: '朱家角镇',
                    service: {
                        name: '朱家角镇社区事务受理中心',
                        tel: '021-59247703',
                        address: '沙家埭路18号',
                        time: '周一至周日上午8:30—11:30 下午13:00—16:30（法定节假日除外）'
                    }
                }, {
                    name: '练塘镇',
                    service: {
                        name: '练塘镇社区事务受理中心',
                        tel: '021-59255965',
                        address: '练塘镇章练塘路900号',
                        time: '周一至周日8:30—16:00 (法定节假日除外)'
                    }
                }, {
                    name: '金泽镇',
                    service: {
                        name: '金泽镇社区事务受理中心',
                        tel: '021-59261029',
                        address: '金中路19号',
                        time: '周一至周日上午8:30-11:00 下午13:30-16:30法定节假日除外)'
                    }
                }
            ]
        }, {
            district: '松江区',
            streets: [
                {
                    name: '岳阳街道',
                    service: {
                        name: '岳阳街道社区事务受理中心',
                        tel: '021-57716655',
                        address: '松江区人民北路73弄-1号',
                        time: '周一至周五上午8:30-11:30 下午13:00-16:30,周六、周日上午9:00-11:30 下午13:00-16:00（法定节假日除外）'
                    }
                }, {
                    name: '中山街道',
                    service: {
                        name: '中山街道社区事务受理中心',
                        tel: '021-67743115',
                        address: '松江区茸梅路139号',
                        time: '周一至周五 上午8：30-11：30 下午13：00-17：00 周六、周日 上午9：00-11：00 下午13：00-15：30 （国定节假日除外）'
                    }
                }, {
                    name: '永丰街道',
                    service: {
                        name: '永丰街道社区事务受理中心',
                        tel: '021-67816119',
                        address: '仓华路623-625号',
                        time: '周一至周五8:30-16:30 周六、周日上午9:00-11:00 下午13:00-15:30,（国定假日休息）'
                    }
                }, {
                    name: '方松街道',
                    service: {
                        name: '方松街道社区事务受理中心',
                        tel: '021-37021526',
                        address: '松江区文涵路733号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—10：30，下午13：00—15：00（法定节假日除外）'
                    }
                }, {
                    name: '九亭镇',
                    service: {
                        name: '九亭镇社区事务受理中心',
                        tel: '021-57635300',
                        address: '松江区九新公路219号2楼',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00 下午13：00—15：00（法定节假日除外）'
                    }
                }, {
                    name: '泗泾镇',
                    service: {
                        name: '泗泾镇社区事务受理中心',
                        tel: '021-57863486',
                        address: '泗泾镇文化路298号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00，下午13：00—15：00（法定节假日除外）'
                    }
                }, {
                    name: '泖港镇',
                    service: {
                        name: '泖港镇社区事务受理中心',
                        tel: '021-57863486',
                        address: '松江区泖港镇中南路35号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00 下午13：00—15：00（法定节假日除外）'
                    }
                }, {
                    name: '车墩镇',
                    service: {
                        name: '车墩镇社区事务受理中心',
                        tel: '021-67654573',
                        address: '车墩镇影视路28弄1号楼',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00，下午13：00—15：30（法定节假日除外）'
                    }
                }, {
                    name: '洞泾镇',
                    service: {
                        name: '洞泾镇社区事务受理中心',
                        tel: '021-57672532',
                        address: '松江区洞泾镇长兴路622号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00 下午13：00—15：30（法定节假日除外）'
                    }
                }, {
                    name: '叶榭镇',
                    service: {
                        name: '叶榭镇社区事务受理中心',
                        tel: '021-57805798',
                        address: '叶榭镇强恕路138-158号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00，下午13：00—15：30（法定节假日除外）'
                    }
                }, {
                    name: '新桥镇',
                    service: {
                        name: '新桥镇社区事务受理中心',
                        tel: '021-57642626',
                        address: '新桥镇新站路460号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00，下午13：00—15：30（法定节假日除外）'
                    }
                }, {
                    name: '石湖荡镇',
                    service: {
                        name: '石湖荡镇社区事务受理中心',
                        tel: '021-57753525',
                        address: '石湖荡镇学府路160号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00 下午13：00—15：30（法定节假日除外）'
                    }
                }, {
                    name: '新浜镇',
                    service: {
                        name: '新浜镇社区事务受理中心',
                        tel: '021—57892224',
                        address: '新浜镇新绿街398号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00，下午13：00—15：30（法定节假日除外）'
                    }
                }, {
                    name: '佘山镇',
                    service: {
                        name: '佘山镇社区事务受理中心',
                        tel: '021-57659776',
                        address: '佘山镇佘新路358号',
                        time: '周一至周五上午8：30—下午16：30；双休日上午9：00—11：00，下午13：00—15：30（法定节假日除外）'
                    }
                }, {
                    name: '小昆山镇',
                    service: {
                        name: '小昆山镇社区事务受理服务中心',
                        tel: '021-57761030',
                        address: '鹤溪街57号',
                        time: '周一至周五上午8:30-11:15下午13:30-16:30，周六、周日上午9:00-11:00下午13:30-15:30（法定节假日除外）'
                    }
                }
            ]
        }, {
            district: '嘉定区',
            streets: [
                {
                    name: '嘉定镇街道',
                    service: {
                        name: '嘉定镇街道社区事务受理中心',
                        tel: '021-59928106',
                        address: '塔城路360弄8号',
                        time: '周一至周五8：30－17：00 周六至周日8：30-16：00（法定节假日除外）'
                    }
                }, {
                    name: '新成路街道',
                    service: {
                        name: '新成路街道社区事务受理中心',
                        tel: '021-59986381',
                        address: '新成路155号',
                        time: '周一至周五8:30-17:00 周六至周日8:30-16:00（法定节假日除外）'
                    }
                }, {
                    name: '真新新村街道',
                    service: {
                        name: '真新新村街道社区事务受理中心',
                        tel: '021-59197632',
                        address: '清峪路985号',
                        time: '周一至周五8：30-17：00 周六至周日9：00-16：00（法定节假日除外）'
                    }
                }, {
                    name: '马陆镇',
                    service: {
                        name: '马陆镇社区事务受理中心',
                        tel: '021-59153113',
                        address: '沪宜公路2228号',
                        time: '周一至周五8：30－17：00 周六至周日8：30-16：00（法定节假日除外）'
                    }
                }, {
                    name: '南翔镇',
                    service: {
                        name: '南翔镇社区事务受理中心',
                        tel: '021-59126004',
                        address: '古漪园路358号',
                        time: '周一至周五上午8：00－11：00 下午13：00－17：00周六至周日上午8：00－11：00；下午13：00－17：00（法定节假日除外）'
                    }
                }, {
                    name: '江桥镇',
                    service: {
                        name: '江桥镇社区事务受理中心',
                        tel: '021-69001302',
                        address: '华江支路129号5号楼',
                        time: '周一至周五8:30-17:00  周六至周日8:30-16:00（法定节假日除外）'
                    }
                }, {
                    name: '黄渡镇',
                    service: {
                        name: '黄渡镇社区事务受理服务中心',
                        tel: '021-69580303',
                        address: '绿苑路39号',
                        time: '周一至周五8:30-17:00  周六至周日8:30-16:00（法定节假日除外）'
                    }
                }, {
                    name: '安亭镇',
                    service: {
                        name: '安亭镇社区事务受理中心',
                        tel: '021-69578880',
                        address: '民丰路988号',
                        time: '周一至周五8:30—17:00 周六至周日8:30—16:00（法定节假日除外）'
                    }
                }, {
                    name: '外冈镇',
                    service: {
                        name: '外冈镇社区事务受理中心',
                        tel: '021-39106683',
                        address: '瞿门路518号',
                        time: '周一至周五8:30-17:00  周六至周日8:30-16:00（法定节假日除外）'
                    }
                }, {
                    name: '徐行镇',
                    service: {
                        name: '徐行镇社区事务受理中心',
                        tel: '021-59559801',
                        address: '新建一路1568号',
                        time: '周一至周五8:30-17:00  周六至周日8:30-16:00（法定节假日除外）'
                    }
                }, {
                    name: '华亭镇',
                    service: {
                        name: '华亭镇社区事务受理中心',
                        tel: '021-39981040',
                        address: '高石路1433号',
                        time: '周一至周五8:30—17:00 周六至周日8:30—16:01（法定节假日除外）'
                    }
                }, {
                    name: '嘉定工业区',
                    service: {
                        name: '嘉定工业区社区事务受理服务中心',
                        tel: '021-69960031',
                        address: '永盛路2703号',
                        time: '周一至周五8:30-17:00  周六至周日8:30-16:00（法定节假日除外）'
                    }
                }, {
                    name: '菊园新区',
                    service: {
                        name: '菊园新区社区事务受理服务中心',
                        tel: '021-69016000',
                        address: '平城路811号',
                        time: '周一至周五8:30-17:00  周六至周日8:30-16:00（法定节假日除外）'
                    }
                }
            ]
        }, {
            district: '金山区',
            streets: [
                {
                    name: '石化街道',
                    service: {
                        name: '石化街道社区事务受理中心',
                        tel: '021-57933627',
                        address: '卫零路485号',
                        time: '周一至周五上午8:30-11:15 下午13:30-16:30 周六、周日上午8:30-11:15 （法定节假日除外）'
                    }
                }, {
                    name: '枫泾镇',
                    service: {
                        name: '枫泾镇社区事务受理中心',
                        tel: '021-57353407',
                        address: '枫杰路51号',
                        time: '周一至周五8:30-17:00  周六至周日8:30-16:00（法定节假日除外）'
                    }
                }, {
                    name: '朱泾镇',
                    service: {
                        name: '朱泾镇社区事务受理中心',
                        tel: '021-57317431',
                        address: '人民路360号',
                        time: '周一至周五上午8:30-11:00 下午13:00-16:30；周六、周日上午8:30—11:00（法定节假日除外）'
                    }
                }, {
                    name: '亭林镇',
                    service: {
                        name: '亭林镇社区事务受理中心',
                        tel: '021-67235370',
                        address: '亭升路550弄33号',
                        time: '周一至周五8：15-16:45 周六、周日上午8:15-11:15 （法定节假日除外）'
                    }
                }, {
                    name: '漕泾镇',
                    service: {
                        name: '漕泾镇社区事务受理中心',
                        tel: '021-37250128',
                        address: '漕泾镇中一西路601号',
                        time: '周一至周五8:30-17:00  周六至周日8:30-16:00（法定节假日除外）'
                    }
                }, {
                    name: '山阳镇',
                    service: {
                        name: '山阳镇社区事务受理中心',
                        tel: '021-57245390',
                        address: '亭卫路1500号',
                        time: '周一至周五上午8:30-11:00，下午12:45-16:30；周六、周日上午8:30-11:00  （法定节假日除外）'
                    }
                }, {
                    name: '金山卫镇',
                    service: {
                        name: '金山卫镇社区事务受理中心',
                        tel: '021-57260692',
                        address: '卫镇古城路319号',
                        time: '周一至周五上午：8:15—11:15；下午：1：00—4:30 周末上午：8:15—11:15 （节假日除外）'
                    }
                }, {
                    name: '张堰镇',
                    service: {
                        name: '张堰镇社区事务受理中心',
                        tel: '021-57213795',
                        address: '张堰镇东贤路951号',
                        time: '周一至周五上午：8:15—11:15；下午：1：00—4:30 周末上午：8:15—11:30 （节假日除外）'
                    }
                }, {
                    name: '廊下镇',
                    service: {
                        name: '廊下镇社区事务受理中心',
                        tel: '021-57395078',
                        address: '金山区景乐路228号',
                        time: '周一至周五上午8:30-16:30;周六、周日上午8:30-11:30 （节假日除外）'
                    }
                }, {
                    name: '吕巷镇',
                    service: {
                        name: '吕巷镇社区事务受理中心',
                        tel: '021-57371365',
                        address: '吕巷镇溪南路58号',
                        time: '周一至周五上午8:30-16:30;周六、周日上午8:30-11:00 （节假日除外）'
                    }
                }, {
                    name: '金山工业区',
                    service: {
                        name: '金山工业区社区事务受理服务中心',
                        tel: '021-57270729',
                        address: '金山工业区恒顺路280弄15号',
                        time: '周一至周五上午8:30-16:30;周六、周日上午8:30-11:00 （节假日除外）'
                    }
                }
            ]
        }
    ];
};

LocationSvc.prototype.getDistricts = function() {
    return new Promise((resolve, reject) => {
        var d = [];
        _.forEach(this.locations, x => {
            d.push(x.district);
        });
        resolve(d);
    });
};

LocationSvc.prototype.getStreetsByDistrict = function(district) {
    return new Promise((resolve, reject) => {
        var target = _.find(this.locations, x => {
            return x.district === district;
        });
        resolve(target);
    });
};

LocationSvc.prototype.getCurrentLocation = function() {
    return new Promise((resolve, reject) => {
        wx.getLocation({
            type: 'wgs84',
            success: function(res) {
                var latitude = res.latitude //纬度
                var longitude = res.longitude //经度
                request(GLOBAL.SERVER + "/user/getLocation/" + longitude + "/" + latitude, null, "GET").then(data => {
                    resolve(data);
                })
            },
            fail: function(err) {
                // reject(err)
                // request(GLOBAL.SERVER + "/hospital/getAll/-1/-1", null, "GET").then(data => {
                //     resolve(data);
                // });
                console.log("拒绝")
            }
        })
    })
}

module.exports = LocationSvc;
